{
  "totalJobs": 62,
  "locations": [
    "Bangalore",
    "Pune",
    "Mumbai",
    "Gurugram",
    "Ahmedabad"
  ],
  "searchQuery": "\"software engineer\" OR \"software developer\" OR \"backend engineer\" OR \"backend developer\" OR \"application developer\" OR \"application engineer\" OR \"node\" OR \"full stack\"",
  "scrapedAt": "2025-11-13T16:13:34.507Z",
  "jobs": [
    {
      "location": "Bangalore",
      "scrapedAt": "2025-11-13T15:59:54.595Z",
      "title": "Software Developer",
      "company": "SKELIA TECHNOLOGIES",
      "description": "About the job\n            \n\n            \n                \n                  Company Description SKELIA TECHNOLOGIES is a leading provider of technology and IT-related consulting services, offering innovative IT strategies to help businesses optimize operations and enhance performance. The company specializes in areas such as cost reduction, risk management, and enabling clients to achieve greater efficiency, innovation, and adaptability. Known for challenging traditional consulting norms, SKELIA TECHNOLOGIES places a strong emphasis on integrity, ethical practices, and transparency in all business dealings. With a commitment to creating value for clients while maintaining responsibility toward people, the planet, and society, SKELIA TECHNOLOGIES fosters a sustainable and socially responsible business approach. This philosophy guides their impactful work with private companies, governments, and non-profit organizations. Role Description This is a full-time, on-site role for a Software Developer based in Bengaluru. The Software Developer will be responsible for designing, developing, testing, and maintaining software applications. On a daily basis, this role involves implementing back-end solutions, creating efficient and secure code, and collaborating with cross-functional teams to deliver innovative technology solutions. The candidate will also work to troubleshoot, debug, and enhance software to meet organizational and client needs. Qualifications       Strong foundation in Computer Science principles, including algorithms and data structuresExperience in Back-End Web Development and Software DevelopmentProficiency in Programming languages and Object-Oriented Programming (OOP) conceptsAbility to solve complex problems and develop innovative technical solutionsEffective collaboration and communication skillsBachelor's or higher degree in Computer Science, Software Engineering, or related fieldFamiliarity with software development tools and version control systems (e.g., Git) is a plusExperience working on large-scale projects or in an agile development environment will be an advantage",
      "jobId": "4340254891",
      "jobUrl": "https://www.linkedin.com/jobs/view/4340254891"
    },
    {
      "location": "Bangalore",
      "scrapedAt": "2025-11-13T16:00:06.921Z",
      "title": "39546-69808 -Growth-SF-Software Engineer II (IND)",
      "company": "Carelon Global Solutions India",
      "description": "About the job\n            \n\n            \n                \n                  Position Title39546-69808 -Growth-SF-Software Engineer II (IND)Job FamilyIFT > Engineering /DevShiftJob Description:Job TypeFull time",
      "jobId": "4336002155",
      "jobUrl": "https://www.linkedin.com/jobs/view/4336002155"
    },
    {
      "location": "Bangalore",
      "scrapedAt": "2025-11-13T16:00:19.280Z",
      "title": "Software Engineer 1",
      "company": "Intuit",
      "description": "About the job\n            \n\n            \n                \n                  OverviewAbout IntuitIntuit is a global technology platform that helps our customers and communities overcometheir most important financial challenges. Serving approximately 100 million customersworldwide with TurboTax, QuickBooks, Credit Karma and MailChimp, we believe thateveryone should have the opportunity to prosper. We never stop working to find new,innovative ways to make that possible. Please visit us for the latest information about Intuit,our products and services, and to know more about working at Intuit.Your work. Your impact.You’re here to take risks and push boundaries. You will work on problems that transform howmillions of consumers and small businesses manage their finances. You will engineersolutions that can be scaled to millions of users. You will be working on technologiesincluding the latest in front-end and web technologies, mobile, big data technologies, AI/ML,DevOps, etc.,And you'll do so in a culture that embraces experimentation and rapid prototyping.Interacting with customers and iterating rapidly will help you understand their pain pointsand take your ideas further faster. You will work closely with senior team members andengineering leaders who guide and mentor you in this journey.ResponsibilitiesResponsibilities:       Work on our core products and services or those that support critical functions of\nour engineering operations. Deliver solutions that solve complex problems forcustomers.       Learn and apply carefully defined practices around engineering and operational\nexcellence to design, implement, and operate software systems at scale       Build eRective working relationships with team members and contribute in a\nmeaningful way.       Learn innovation methods like Design 4 Delight and Lean Start-In to come up with\ninnovative solutions for our most complex problemsQualificationsQualifications:       Bachelor or Integrated Dual degree in computer science or a related technical field Solid understanding of Agile development, software fundamentals, object-oriented\ndesign, and programming languages       Extensive programming experience with one or more of the following: C#, Java, C++,\nPython       Knowledge of front-end web design and languages (D/HTML, JavaScript, XML, Flex,\nCSS)       Strong written, verbal, and collaboration skills Ability to problem-solve and adapt to changing priorities and technologies in a fast-\npaced, dynamic environment       Familiarity or the ability to learn current trends and best practices in technology\nRoles IncludeSoftware Engineer: Full Stack/Front-End/Back-End/DevOps/Mobile/Data EngineeringLocation:BangaloreIntuit provides a competitive compensation package with a strong pay for performance rewards approach. This position will be eligible for a cash bonus, equity rewards and benefits, in accordance with our applicable plans and programs (see more about our compensation and benefits at Intuit®: Careers | Be",
      "jobId": "4322078639",
      "jobUrl": "https://www.linkedin.com/jobs/view/4322078639"
    },
    {
      "location": "Bangalore",
      "scrapedAt": "2025-11-13T16:00:31.677Z",
      "title": "Senior Software Engineer - GoLang Developer",
      "company": "Sutherland",
      "description": "About the job\n            \n\n            \n                \n                  Company DescriptionAbout Sutherland: Artificial Intelligence. Automation. Cloud engineering. Advanced analytics. For business leaders, these are key factors of success. For us, they’re our core expertise.We work with iconic brands worldwide. We bring them a unique value proposition through market-leading technology and business process excellence.We’ve created over 200 unique inventions under several patents across AI and other critical technologies. Leveraging our advanced products and platforms, we drive digital transformation, optimize critical business operations, reinvent experiences, and pioneer new solutions, all provided through a seamless “as a service” model.For each company, we provide new keys for their businesses, the people they work with, and the customers they serve. We tailor proven and rapid formulas, to fit their unique DNA. We bring together human expertise and artificial intelligence to develop digital chemistry. This unlocks new possibilities, transformative outcomes and enduring relationships.SutherlandUnlocking digital performance. Delivering measurable resultsJob DescriptionIn the Role you get:       Hands on experience in GoLang, NodeJS 5 to 7 years of technical experience in full stack development Hands-on experience in Angular Hands-on experience with scripting languages in the back end (NodeJS, Python, Golang etc). Hands-on experience delivering microservices based architectures and design Hands-on experience working with Kubernetes based applications and container workloads Cloud Native (specifically good experience designing 12-factor apps). In depth understanding of Contract first/API first design and delivery experience. Strong experience in API design (OAS, middleware, external vs internal facing, etc.) Define Sutherland’s reputation: Oversee and manage performance and service quality to guarantee customer satisfaction; provide coaching and feedback. Work towards common goal of “One Sutherland Team playing to win”.\nQualificationsOur most successful candidates will have:       Academic: BE / BTECH (CSE, IT), B.Sc. (Computers), BCA / MCA Or Other Bachelor / Master’s Degree in Computing / IT preferred Functional Domain: Healthcare IT / IT Services Delivery domain. - Experience: Relevant years of experience in similar role. Communication skills: Have strong verbal and written communication skills, be able to communicate in a clear, constructive, and professional manner. Personality: Good time-management skills. Team player: Be pro-active in developing trust and professional rapport with employees and team members; work as a team-player Ability to handle multiple tasks simultaneously. Ability to work in a fast-paced environment with minimal supervision. Sense of ownership and pride in your performance and its impact on the company’s success. Critical thinker and problem-solving skills. Be strategic in developing solutions and process improveme",
      "jobId": "4335743534",
      "jobUrl": "https://www.linkedin.com/jobs/view/4335743534"
    },
    {
      "location": "Bangalore",
      "scrapedAt": "2025-11-13T16:00:44.074Z",
      "title": "Software Engineer",
      "company": "Care.fi",
      "description": "About the job\n            \n\n            \n                \n                  Today, an Indian hospital revenue is largely dominated by Insurance payers - Govt + Private. With 200+ payers in the mix, the overall revenue cycle management (RCM) in India is broken, opaque, and complex filled with unexpected shortfalls and delayed realizations.At Care.fi, we are building India’s first AI-led RCM platform for hospitals which will enable them to solve these pitfalls and thereby improving margins. Backed by marquee investors such as Peak XV (erstwhile Sequoia India) we are already a trusted partner for top Indian brands including Apollo, Fortis, Narayana Health, and Aster Group.About the RoleWe’re looking for a Software Engineer (Kotlin/Java) with 2–4 years of experience who’s hungry to learn, eager to build, and ready to grow fast. You’ll work closely with senior engineers, product managers, and business stakeholders to build high-impact systems that power hospital operations and patient flows.This is a great opportunity for someone who wants ownership, autonomy, and real-world impact early in their career.What You'll Do      Design, develop, and maintain backend services using JVM-based technologies (Kotlin)Work on APIs, databases, and internal tools that serve hospital staff, operations teams, and patientsTranslate real-world workflows into clean, efficient codeCollaborate with cross-functional teams to ship new features quicklyConstantly improve the system’s performance, reliability, and usability\nWhat We're Looking For      2–4 years of software development experience specifically in backendComfortable working with JVM-based languages (Java, Kotlin, or Scala preferred)Working knowledge of public cloud like AWS, GCP etcKnowledge of CI/CD pipelines and end to end ownership of application.A self-starter who learns quickly and thrives in ambiguityPassionate about solving real-world problems through tech\n      Why Carefi\n      Work on real problems that matter — healthcare, payments, and patient journeysSmall team = high ownership and fast learningBe part of a mission-driven, product-first cultureCompetitive compensation and flexible work setup",
      "jobId": "4322048608",
      "jobUrl": "https://www.linkedin.com/jobs/view/4322048608"
    },
    {
      "location": "Bangalore",
      "scrapedAt": "2025-11-13T16:00:56.442Z",
      "title": "Full Stack Developer (Python, AWS, Flask, MongoDB)",
      "company": "eShipz",
      "description": "About the job\n            \n\n            \n                \n                  Company DescriptioneShipz is an innovative logistics automation platform that simplifies shipping operations and enhances post-purchase experiences for businesses. Our robust solution offers multi-carrier integrations, automated shipping labels, real-time tracking, NDR management, and analytics to enable streamlined operations. Trusted by over 350 businesses across industries including eCommerce and enterprise sectors, eShipz is designed to provide reliable capabilities and excellent customer support. With advanced technology and user-friendly tools, we empower businesses to deliver smarter and more efficient shipping solutions. Learn more at www.eshipz.com.Role DescriptionWe are seeking a Full Stack Developer with expertise in Python, AWS, Flask, and MongoDB for a full-time, Remote role. The responsibilities include designing, developing, and maintaining both front-end and back-end components of web applications. You will collaborate with cross-functional teams to ensure seamless integration between systems while working with state-of-the-art technology to create efficient, scalable, and user-friendly solutions. You will also participate in code reviews, bug fixing, and improving application performance.Qualifications      Proficiency in Back-End Web Development using Python, AWS, Flask, and other relevant frameworksExperience in Front-End Development and skills in technologies such as HTML, CSS, and JavaScriptStrong capabilities in Software Development and Full-Stack Development with the ability to build scalable and maintainable systemsSolid understanding of Cascading Style Sheets (CSS) and creating visually appealing, responsive user experiencesIn-depth knowledge of working with databases, particularly MongoDBStrong problem-solving abilities and a collaborative mindsetEducational background in Computer Science, Software Engineering, or related fieldsExperience with Agile methodologies and version control systems is a plus",
      "jobId": "4322098564",
      "jobUrl": "https://www.linkedin.com/jobs/view/4322098564"
    },
    {
      "location": "Bangalore",
      "scrapedAt": "2025-11-13T16:01:08.806Z",
      "title": "Software Developer ( Walkin on November 15, 2025)",
      "company": "ElasticDevs",
      "description": "About the job\n            \n\n            \n                \n                  Job Title: Software Developer [ Walkin on 15th November , 2025 ]Reporting Time: 11:30 AMExperience: 0 -1 yearWork Mode: On-siteLocation: 4th Floor, Level 3, Office C, Obeya Nest, 1126, 18th Cross Rd, 7th Sector, HSR Layout, Bengaluru, Karnataka 560102About the Company:ElasticDevs is a leading innovator in the tech industry, committed to delivering cutting-edge solutions that drive the future of technology.Key Responsibilities:      Collaborate with Tech lead, designers, and other engineers to deliver high-quality software solutions.Participate in code reviews to maintain code quality and share knowledge with team members.Troubleshoot and debug software issues, providing timely resolutions.Write and maintain technical documentation.Stay updated with emerging technologies and industry trends.Contribute to continuous improvement processes within the team.\nRequired Skills and Qualifications:      Bachelor’s degree in Computer Science, Engineering, or a related field.Strong understanding of various data structures such as arrays, linked lists, trees, graphs, and hash tables.Proficiency in one or more programming languages such as Java, C++, Python, or JavaScript.Excellent problem-solving skills and attention to detail.Ability to work collaboratively in a team environment.Good communication skills, both written and verbal\nNote:      Bring an updated resume.Please ensure you report to the location at least 10 minutes prior to the scheduled time.",
      "jobId": "4322056473",
      "jobUrl": "https://www.linkedin.com/jobs/view/4322056473"
    },
    {
      "location": "Bangalore",
      "scrapedAt": "2025-11-13T16:01:21.149Z",
      "title": "Full Stack Software Developer - React Native /Android/iOS (Part Time)",
      "company": "NUSHOOT LLP",
      "description": "About the job\n            \n\n            \n                \n                  Company DescriptionWe suggest you enter details here.Role Description      This is a part-time remote-work role for a Full Stack Software Developer - React Native / Android / iOS. The role is located in Bangalore Urban. • Hands-on experience in design and coding in React Native, Android, iOS and MongoDB technologies• Ability to work with AI tools and models including prompt generation needed for development, testing and debugging• Exposure in Google Play Store and iOS App Store development and review cycles for deployment and maintenance. Previous experience with mobile application development on Android/iOS is a plus . The candidate will also be involved in troubleshooting and debugging applications to optimize performance utilizing AI agents and their recommendations.\nQualifications      Hands-on experience in design and coding in  Frontend - Cross platform tech stack essentially in React Native(web) & Mobile dev: Android, iOS  Backend - MongoDB / FSM Notifications. Proficiency in Back-End Web Development (MERN , MongoDB)Ability to work on goal-oriented SW development assignment on part-time (minimum 4 to 6 hours/day daily)Ability to work with AI tools and models including prompt generation needed for development, testing and debugging - familiarization with AI editors like Cursor , Code from AI agent utilization and code debugExposure in Google Play Store and iOS App Store development and review cycles for deployment and maintenance.Experience in Front-End Development including expertise in React Native, and Cascading Style Sheets (CSS)Excellent problem-solving and debugging skillsAbility to work collaboratively with cross-functional teamsBachelor’s degree in computer science, Information Technology, or a related field.",
      "jobId": "4318371370",
      "jobUrl": "https://www.linkedin.com/jobs/view/4318371370"
    },
    {
      "location": "Bangalore",
      "scrapedAt": "2025-11-13T16:01:33.497Z",
      "title": "Software Engineer AI",
      "company": "Advisor360°",
      "description": "About the job\n            \n\n            \n                \n                  At Advisor360°, we build technology that transforms how wealth management firms operate, scale, and serve their clients. As a leading SaaS platform in the fintech space, we’re trusted by some of the largest independent broker-dealers and RIAs to power the full advisor and client experience—from portfolio construction and reporting to compliance and client engagement.What sets us apart? It's not just the tech (though it's best-in-class). It's the people, the purpose, and the passion behind everything we do. We’re a team of builders, thinkers, and doers who believe that great companies are defined by the stories they tell and the experiences they create—internally and externally. We bring deep industry expertise, a collaborative spirit, and a commitment to innovation as we reshape what’s possible in wealth management.As we grow, we’re looking for teammates who are ready to roll up their sleeves, think big, and help elevate our brand in a way that reflects the bold ambitions we have for our company and the clients we serve.Join us, and be part of a company that's not only moving fast—but making it count.At Advisor360°, we’re re-architecting wealth management around intelligent software. Our AI teammates don’t live in labs—they live in production, automating real advisor workflows from meeting prep to document parsing to CRM insights.We’re looking for a strong software engineer who can design and deliver scalable systems that use AI as a capability, not a crutch. This isn’t about building models—it’s about building great software that uses models.Here’s What You’ll Do      Build and maintain services and APIs that power AI-driven workflows across our platform.Work closely with our AI and data teams to integrate LLMs, embeddings, and event-driven pipelines into real features.Develop SDKs, agents, and orchestration tools that enable reuse and reliability of AI components.Improve system observability, tracing, and resilience across AI-enabled and non-AI services.Contribute to technical design, peer reviews, and architectural decisions across the AI initiative. \nWhat You Bring To The Table      Deep fluency in one or more core languages (C#, Python, etc).Solid foundation in distributed systems, APIs, and asynchronous processing.Experience with message queues, caching, and data pipelines.Comfort working with LLM APIs, embeddings, or vector search (OpenAI, Azure AI, Pinecone, etc.).Pragmatism—know when to use AI, when to use code, and when to simplify.Familiarity with CI/CD, GitHub Actions, containerized builds, and cloud deployment (Azure preferred).\nBonus Points      Full Stack experience (React, Angular, or similar).Experience building internal SDKs, developer tools, or workflow orchestration systems.Familiarity with LangGraph, Semantic Kernel, or similar frameworks.Understanding of data privacy and compliance in financial systems.\nWho You AreYou’re an engineer first, curious al",
      "jobId": "4316232233",
      "jobUrl": "https://www.linkedin.com/jobs/view/4316232233"
    },
    {
      "location": "Bangalore",
      "scrapedAt": "2025-11-13T16:01:45.977Z",
      "title": "Full Stack Developer (Mid-Level)",
      "company": "4baseCare",
      "description": "About the job\n            \n\n            \n                \n                  We’re Hiring: Full Stack Developer (Mid-Level)Are you a passionate developer who loves building scalable, high-impact web applications?Join 4baseCare Precision Health Pvt. Ltd., where innovation meets purpose! 🚀💼 Position: Full Stack Developer (Java, Node.js, React, MySQL, Angular)📍 Location: Bangalore🕓 Experience: 2+ years🔧 What You’ll Do      Design, develop, and implement robust and scalable web applications using Java, Node.js, and React.js.\n      Develop and integrate RESTful APIs for seamless front-end and back-end communication.\n      Manage and optimize MySQL databases — schema design, query performance, and scalability.\n      Collaborate with UX/UI designers, product managers, and developers to deliver world-class features.\n      Write clean, maintainable, and testable code following best practices.\n      Participate in code reviews and mentor junior developers.\n      Troubleshoot, debug, and enhance production systems.\n      Implement secure authentication and authorization (JWT, OAuth).\n      Work with Microservices architecture and stay updated with the latest tech trends.\n🎯 What We’re Looking For      Bachelor’s degree in Computer Science, Engineering, or related field.\n      2+ years of experience in Full Stack Development (Java, Node.js, React).\n      Strong hands-on with MySQL, HTML, CSS, JavaScript, TypeScript.\n      Familiar with Git/GitHub, Agile methodologies, and unit testing (Jest, Chai, Mocha).\n      Excellent problem-solving skills, teamwork, and communication.\n🌈 Bonus Points For      Experience with AWS / GCP.\n      Exposure to Docker / Kubernetes.\n      Familiarity with CI/CD tools like Jenkins, GitLab CI, or BitBucket Pipelines.\n      Knowledge of Angular.js or Python.\n✨ If you’re ready to code, collaborate, and create impact — we’d love to hear from you!📩 Apply Now: careers@4basecare.com",
      "jobId": "4322116481",
      "jobUrl": "https://www.linkedin.com/jobs/view/4322116481"
    },
    {
      "location": "Bangalore",
      "scrapedAt": "2025-11-13T16:01:58.333Z",
      "title": "Software Engineer 2",
      "company": "Archer Integrated Risk Management",
      "description": "About the job\n            \n\n            \n                \n                  Job DetailsDescriptionGENERAL SUMMARY: Archer is the industry-leading enterprise software for Integrated Risk Management and recognized as leaders in the Gartner quadrant for several years now. Archer helps organizations manage risk in the digital era—uniting stakeholders, integrating technologies, and transforming risk into reward. Over a thousand customers worldwide harness the ArcherIRM platform and its comprehensive suite of solutions to automate the compliance process, meet their risk objectives, and optimize business.This position is for a modern and brand new SaaS product “Archer Engage” having 120+ customers worldwide. Archer Engage suite of products delivers a modern, consumer app-like user experience to the infrequent users and stake holders to ensure active engagement in helping the enterprise manage risk and third-party risk management. Engage is based on serverless architecture and built on cutting edge technology stack comprising of AWS Cloud Native Services, ReactJS,.NETCore, NodeJS, Kubernetes and Gitlab CI/CD. For more information, visit https://www.archerirm.com/We are seeking a passionate, self-motivated Software Quality Engineer with proven hands-on experience in Manual and Automated testing. You will be joining a top notch and highly motivated team of DevOps engineers who thrive on end-to-end ownership of entire product life cycle starting from design to deployment to operations.Principal Duties And Responsibilities      Authors and executes test cases and testing methodology for manual and/or automated tests.Understands and adheres to delivery/quality targets established during regression and testing phase.Contribute to test automation activities through knowledge of coding/programming in current languages.Develops new test methodologies or processes, re-evaluates existing processes. Contributes to the development and achievement of organizational goals and objectives.General understanding of business environment. Fosters teamwork and collaboration within and across work groups.Responsible for providing requirements and specifications for the test cases.Accountable for delivery of subsystem, anticipate issues and addresses proactively.Fully competent in the design, implementation, and maintenance of a test environment, including necessary equipment, configuration, and software.Demonstrated skill with developing appropriate test methodologies. Fully competent in the use of necessary tools and applications.\nRequired Skills      Good knowledge in SDLCExperience in Software Test Life Cycle (Test Estimation, Test Strategy, Test Plan, Testing, Defect Mgmt, etc) General knowledge of .NET, MS SQL, JavaScript.Experience in UI & API Test Automation Framework (Preferably Playwright)Experience in Test automation scripting (Say, Typescript)Experience in Agile.Working knowledge in Enterprise SaaS productEducation: BE/BTech/MCA or equivalent Computer Science qualif",
      "jobId": "4340533723",
      "jobUrl": "https://www.linkedin.com/jobs/view/4340533723"
    },
    {
      "location": "Bangalore",
      "scrapedAt": "2025-11-13T16:02:10.661Z",
      "title": "Software Engineer - Java Fullstack Angular",
      "company": "EPAM Systems",
      "description": "About the job\n            \n\n            \n                \n                  Join our team as a Software Engineer focusing on Java full-stack development with Angular.You will contribute to web and mobile application development using cloud technologies and collaborate on design, development, and production releases. This role offers an opportunity to apply your skills in both front-end and back-end technologies while working with clients. If you are passionate about delivering quality software solutions, we encourage you to apply. Responsibilities      Develop and maintain front-end web applications using Angular, JavaScript, HTML, and CSSImplement back-end services and APIs using Java 8, Spring, Spring Boot, and REST APIDesign and develop microservices architectures to support scalable applicationsCollaborate with cross-functional teams to resolve technical issues in design, development, and productionBuild and maintain CI/CD pipelines to automate deployment processesWrite unit and integration tests using JUnit to ensure software qualityWork closely with clients to understand requirements and deliver high-quality solutionsApply best practices and design patterns in software developmentContribute to continuous improvement of development processes and toolsSupport both server-side and client-side rendering as neededParticipate in code reviews and provide constructive feedbackDocument software components and maintain technical documentationTroubleshoot and debug issues to ensure application performance and reliabilityStay updated with emerging technologies relevant to the projectAssist in deployment and monitoring of applications in cloud environments\n Requirements      3 to 5 years of experience in software development with a focus on Java fullstackProficiency in Java 8 and frameworks such as Spring and Spring BootExperience with front-end technologies including Angular, JavaScript, HTML, and CSSKnowledge of REST API design and implementationBackground in using relational databases such as PostgreSQL or OracleFamiliarity with microservices architecture and cloud-based application developmentSkills in writing unit tests using JUnit or similar frameworksExperience with CI/CD pipelines and version control systemsUnderstanding of common programming design patterns and best practicesCapability to resolve technical problems across design, development, and productionStrong problem-solving skills and attention to detailAbility to communicate effectively in written and verbal EnglishExperience with web development tools and package managers",
      "jobId": "4311462564",
      "jobUrl": "https://www.linkedin.com/jobs/view/4311462564"
    },
    {
      "location": "Bangalore",
      "scrapedAt": "2025-11-13T16:02:23.029Z",
      "title": "Software Engineer 1",
      "company": "PowerSchool",
      "description": "About the job\n            \n\n            \n                \n                  OverviewAt PowerSchool, we are a dedicated team of innovators guided by our shared purpose of powering personalized education for students around the world. From the central office to the classroom to the home, PowerSchool supports the entire educational ecosystem as the global leader of cloud-based software for K-12 education. Our employees make it all possible, and a career with us means you’re joining a successful team committed to engaging, empowering, and improving the K-12 education experience everywhere.Team OverviewOur Support team provides a broad spectrum of training and technical support for our customers. From accurately analyzing and troubleshooting, to diagnosing and resolving software or system issues, this team offers world-class technical support with a strong focus on maximizing customer satisfaction.Description Responsibilities The Software Engineering team is a group of full stack developers who design, develop, and maintain our products, tools, and infrastructure.Your day-to-day job will consist of:      Developing assessment loading import tools using a combination of JavaScript, JSON, SQL and PythonTroubleshooting issues with the data import toolsPerforming code reviews and other QA checks and audits to ensure that code is high quality, efficient and meets coding standardsWorking with a variety of legacy and new code and toolsContribute to the definition and execution of the evolution of our assessment import process and software tools for the Analytics and Insights product, working with cross functional teamsLoad customer data and interact with customers to address questions as requiredDocument code, work process, and contribute to the planning and documentation of new software tools.\nQualificationsMinimum Qualifications      Minimum of 2 years of relevant and related work experience.Bachelor’s degree or equivalent, or equivalent years of relevant work experience.At least 2 years experience with JavaScript, JSON, SQLAt least 2 years experience working as a client facing resource in a software development role Strong written and verbal communication skillsAbility to work in a fast-paced, dynamic environmentAbility to work U.S. aligned work schedule\nPreferred Qualifications       Experience with Python Experience with cloud platforms, such as AWS or Azure, is a plus.Solid understanding of database design and query optimization\n EEO Commitment EEO CommitmentPowerSchool is committed to a diverse and inclusive workplace. PowerSchool is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. Our inclusive culture empowers PowerSchoolers to deliver the best results for our customers. We not only celebrate the diversity of our workforce, we celebrate the diverse ways we work. If you have a disabil",
      "jobId": "4296718224",
      "jobUrl": "https://www.linkedin.com/jobs/view/4296718224"
    },
    {
      "location": "Bangalore",
      "scrapedAt": "2025-11-13T16:02:35.406Z",
      "title": "Software Engineer 1 - Platform",
      "company": "Rippling",
      "description": "About the job\n            \n\n            \n                \n                  About RipplingRippling gives businesses one place to run HR, IT, and Finance. It brings together all of the workforce systems that are normally scattered across a company, like payroll, expenses, benefits, and computers. For the first time ever, you can manage and automate every part of the employee lifecycle in a single system.Take onboarding, for example. With Rippling, you can hire a new employee anywhere in the world and set up their payroll, corporate card, computer, benefits, and even third-party apps like Slack and Microsoft 365—all within 90 seconds.Based in San Francisco, CA, Rippling has raised $1.4B+ from the world’s top investors—including Kleiner Perkins, Founders Fund, Sequoia, Greenoaks, and Bedrock—and was named one of America's best startup employers by Forbes.We prioritize candidate safety. Please be aware that all official communication will only be sent from @Rippling.com addresses.About the roleRippling’s Platform team is building a new Customer Sandbox that lets admins safely try features, validate changes, and reduce production risk. As an SE-1 on this team, you’ll ship core services and tools that make the Sandbox fast, reliable, and easy to use. You’ll own well-defined components end-to-end, contribute to design discussions, and grow through mentorship from senior engineers.What you will do      Build and maintain services/APIs that power the Customer Sandbox (creation, data isolation, reset/refresh, access controls).Implement change-sync and push-to-prod workflows that speed up safe releases.Write high-quality, well-tested code; add diagnostics and dashboards for reliability.Participate in design discussions; turn product requirements into clear technical tasks.Improve developer ergonomics: scripts, CI checks, test data, and docs.Help monitor, triage, and fix issues in lower environments with guidance from the team.Collaborate with product, security, and other platform teams to ship features on time.\nWhat you will need      You have 1+ years of experience with a Bachelors or Masters in Computer Science, or related fieldsKnowledge of algorithms, data structures, and systems architectureFamiliarity with the following programming languages: Python, GoClear, concise communication and a bias toward ownership and learning.\nWhat We Offer      A competitive compensation and benefits package.The chance to work on high-impact, meaningful projects alongside a collaborative and high-caliber team.Opportunities for continuous learning, growth, and career development.An inclusive, fun, and innovative workplace that values diversity and creative thinking.",
      "jobId": "4322166487",
      "jobUrl": "https://www.linkedin.com/jobs/view/4322166487"
    },
    {
      "location": "Bangalore",
      "scrapedAt": "2025-11-13T16:02:47.770Z",
      "title": "Full Stack Engineer - React with Java",
      "company": "Innova ESI",
      "description": "About the job\n            \n\n            \n                \n                  Role: Full Stack Engineer - React with JavaLocation: Bangalore | Pune | Noida | Gurgaon | HyderabadExperience: 7+ YearsImmediate Joiners OnlyKey Responsibilities      Design and implement scalable, responsive web applications using React.js on the front end.Develop RESTful APIs and microservices using Java (Spring Boot) on the back end.Collaborate closely with product managers, designers, and other engineers to deliver end-to-end solutions.Ensure high code quality through best practices such as unit testing, code reviews, and CI/CD.Optimize application performance and maintain application security.Participate in the entire development lifecycle — from requirement analysis to production deployment and maintenance.Troubleshoot, debug, and resolve software defects and production issues.Stay current with emerging technologies and recommend improvements to existing systems and processes.\nRequired Qualifications      Bachelor’s degree in Computer Science, Engineering, or a related field (or equivalent practical experience).3–6 years of experience in full stack development (SAL2 level).Strong hands-on experience with React.js, JavaScript (ES6+), HTML5, CSS3, and related front-end tools.Proficient in Java and Spring Boot for back-end development.Experience with RESTful API design and integration.Familiarity with SQL/NoSQL databases (e.g., PostgreSQL, MySQL, MongoDB).Understanding of version control (Git) and CI/CD pipelines.Experience with cloud platforms (AWS, GCP, or Azure) is a plus.Strong problem-solving skills and attention to detail.",
      "jobId": "4335990795",
      "jobUrl": "https://www.linkedin.com/jobs/view/4335990795"
    },
    {
      "location": "Bangalore",
      "scrapedAt": "2025-11-13T16:03:00.155Z",
      "title": "Software Engineer",
      "company": "Vandelay Technologies India Private Limited",
      "description": "About the job\n            \n\n            \n                \n                  About the Company Vandelay Technologies is a mobile gaming studio looking to bring fun elements from games you know and love like Top Eleven, Football Manager, Golf Clash, etc. to Cricket! We have secured funding from high quality investors, have a game live in early access on the Google Play Store and are now building out our team across functions. We are currently looking for a Unity Developer who will join our engineering team in developing our pipeline of games. You will also be involved in and informed about the other functions of the Company, including brainstorming new features and games. We hate silos and bureaucracy, and truly want to build a team which is just a bunch of people doing what brings them joy – cricket and gaming – professionally. If this excites you, if you have an interest in sports and gaming, and want to build fun games in an early-stage startup, we would love to engage with you. What you will do As a team member in a young startup, you are walking out when the score is 0/0, and have the ability to set the tone and shape the direction of the Company. Your major responsibilities will include:       Write clean code that is readable, maintainable, scalable, and secureArchitect and implement scalable game backend services using Java / Spring BootOptimize backend performance, latency, and scalability for global playersCollaborate with Unity client engineers on networking, gameplay data, and sync logicCollaborate with other engineers to come up with end-to-end cohesive architecture on new featuresUse algorithms, data structures, programming languages, programming paradigms to create, test and operate sustainable user-side or server-side software applications and servicesWork with business to understand end-user requirements and translate those into pragmatic and effective technical solutions\nWhat we are looking for       Bachelor’s Degree in Computer Science (or related discipline)2+ years of backend experience, ideally in mobile gaming; at least one shipped live game or large-scale consumer appProficiency in Java, Spring Boot, and REST API design.Solid grasp of data structures, system design, object-oriented programming.Strong debugging, profiling, and optimization skills.Passion for games, especially sports or strategy titles.Excited about working in a fast-paced start-up environment - more ownership, more hustle, more impact and more opportunitiesStrong communication and interpersonal skills; Able to work independently and as part of a teamOpenness to feedback and the ability to iterate based on feedbackComfort with ambiguity typical of an early-stage startup; Opening the innings comes with having to play in the powerplay - you will potentially face frequently changing timelines and requirementsExcellent team player, ability to work independently and as part of a teamAbility to work from office in Bangalore\nWhat you can expect from us       You wil",
      "jobId": "4322256234",
      "jobUrl": "https://www.linkedin.com/jobs/view/4322256234"
    },
    {
      "location": "Bangalore",
      "scrapedAt": "2025-11-13T16:03:12.560Z",
      "title": "Software Engineer",
      "company": "Tacten.co",
      "description": "About the job\n            \n\n            \n                \n                  About the RoleWe are seeking a highly skilled Full Stack Frappe Developer to design, develop, and maintain applications using the Frappe Framework and ERPNext ecosystem. The ideal candidate will have a strong understanding of both backend and frontend development, database management, and RESTful API integration. You’ll be responsible for building scalable, high-performance solutions tailored to business requirements.Key Responsibilities      Design, develop, and deploy custom Frappe apps and ERPNext modules.Customize and extend existing Frappe/ERPNext functionalities.Integrate third-party APIs and services.Develop front-end interfaces using HTML, CSS, JavaScript, and Jinja templates within Frappe.Write clean, efficient, and reusable code following Frappe’s MVC architecture.Manage database design, performance tuning, and data migrations (MariaDB/MySQL).Implement user roles, permissions, and workflow automations.Perform testing, debugging, and code reviews.Collaborate with cross-functional teams (Design, DevOps, QA) to deliver robust solutions.Maintain and document code, configurations, and deployment processes.\nRequired Skills & Qualifications      Bachelor’s degree in Computer Science, Engineering, or related field.Strong hands-on experience with the Frappe Framework and ERPNext.Proficiency in Python, JavaScript, HTML, CSS, Jinja, and Bootstrap.Solid understanding of REST APIs, webhooks, and microservice integration.Experience with MariaDB/MySQL and basic database administration.Familiarity with Git, version control, and CI/CD pipelines.Knowledge of Linux/Unix environments and server deployment (bench, nginx, supervisor, etc.).Strong problem-solving and debugging skills.\nPreferred Qualifications      Experience in ERPNext customization and implementation.Knowledge of Docker or containerized deployments.Exposure to cloud platforms (AWS, DigitalOcean, GCP).Understanding of Agile/Scrum methodologies.Contribution to open-source Frappe apps or ERPNext community projects.\nSoft Skills      Strong analytical and communication skills.Ability to work independently and as part of a team.Attention to detail and a commitment to high-quality code.Eagerness to learn and adapt to new technologies.\nCompensationCompetitive salary based on experience and skillset.",
      "jobId": "4322206260",
      "jobUrl": "https://www.linkedin.com/jobs/view/4322206260"
    },
    {
      "location": "Bangalore",
      "scrapedAt": "2025-11-13T16:03:24.830Z",
      "title": "Java Full stack Developer",
      "company": "Qualitest",
      "description": "About the job\n            \n\n            \n                \n                  Job Description Technical Skills      Programming Languages: Proficient in Java (8+), JavaScript, HTML, CSS, and PL/SQL. Frameworks & Libraries: Hands-on experience with Spring Boot, React.js, and Node.js. Web Services: Strong knowledge of REST and SOAP API development and integration. Version Control: Experience with Git and collaborative development using GitHub. Backend & Databases: Expertise in Oracle and PostgreSQL (preferred: Postgres shining stars ). CI/CD Tools: Working knowledge of Jenkins, GitHub Actions, and applying TDD/BDD practices. Testing Tools: Experience with ReadyAPI, Postman, Jest, and JUnit for automated and integration testing. Cloud Technologies: Exposure to OCI (Oracle Cloud Infrastructure), Azure, AWS, or equivalent cloud environments. AI Tools: Familiar with GitHub Copilot for enhanced development productivity. Containerization & Microservices: Practical experience with Docker, Kubernetes (K8s), Microservices, and Micro Frontends. \nNice to Have      Test Automation Frameworks: Experience with Selenium, Cucumber (Java), and Kafka integration. \n4 must havesJava: 4/5React JS, Springboot: 4/5Database (Oracle): 3/5CI/CD and Version: 4/5",
      "jobId": "4339902767",
      "jobUrl": "https://www.linkedin.com/jobs/view/4339902767"
    },
    {
      "location": "Pune",
      "scrapedAt": "2025-11-13T16:04:10.672Z",
      "title": "System Software Engineer - GPU/SoC Profiling",
      "company": "NVIDIA",
      "description": "About the job\n            \n\n            \n                \n                  At NVIDIA, we build groundbreaking products for the following sectors: Gaming, Deep Learning, Automotive, Embedded and High Performance Computing.As a member of the GPU/SoC Foundations Developer Tools team, you will be advancing the state of art of our low-level profiling library which aids developers in analyzing and optimizing the performance of their systems/applications.We are seeking a motivated Software Engineer to contribute to the performance triage development and co-design of our software in collaboration with our Hardware Architecture team.Join our team and gain exciting opportunities to work hands-on at every layer of NVIDIA's world-class technology.What You’ll Be Doing      Work with multi-disciplinary teams to design, implement, and verify performance metrics and collection methodologies for NVIDIA GPUs, Video, Vision and many other acceleratorsWork on developing and improving methodologies for profiling data collection from GPUs / SoCsDefine, invent, and improve our profiling library with new features to allow NVIDIA's customers to extract the best performance out of their code baseRead and understand HW specs to design solutions based on itWork on software unit level tests and framework ensuring the quality of the product\nWhat We Need To See      B.Tech. EE/CS or equivalent with 2+ years of work experience or M.Tech. with 1+ years experience, or Ph.D.Strong programming ability in C, C++, scripting languagesKnowledge of Computer Architecture (preferably ARM CPUs/ SoCs or GPUs)Sound Operating Systems fundamentalsKnowledge of hardware-software co-design principles and practices\nWays To Stand Out From The Crowd      Experience in Device drivers or System softwareKnowledge of GPU API's such as: CUDA, OpenCL, OpenGL, Direct3D, VulkanKnowledge of communication bus protocols (AMBA, PCIe, InfiniBand or others)Prior experience authoring developer tools, particularly for GPUs or SoCsKnowledge of hardware performance counters and usage in performance optimizations\nNVIDIA is widely considered to be one of the technology world’s most desirable employers. We have some of the most motivated people in the world working for us. If you are creative and self driven, we want to hear from you.The GPU, our invention, serves as the visual cortex of modern computers and is at the heart of our products and services. Our work opens up new universes to explore, enables amazing creativity and discovery, and powers what were once science fiction inventions from artificial intelligence to autonomous cars. NVIDIA is looking for phenomenal people in multiple disciplines to help us accelerate the next wave of computing.NVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, g",
      "jobId": "4287840292",
      "jobUrl": "https://www.linkedin.com/jobs/view/4287840292"
    },
    {
      "location": "Pune",
      "scrapedAt": "2025-11-13T16:04:23.927Z",
      "title": "Software Engineer, Backend",
      "company": "DoorDash",
      "description": "About the job\n            \n\n            \n                \n                  About the TeamCome help us build the world's most reliable on-demand, logistics engine for delivery! We're bringing on experienced engineers to help us further our 24x7, global infrastructure system that powers DoorDash's three-sided marketplace of consumers, merchants, and dashers.About the RoleThe Data Tools mission is to build robust data platforms and establish policies that guarantee the analytics data is of high quality, easily accessible/cataloged, and compliant with financial and privacy regulations, fostering trust and confidence in our data-driven decision-making process.We are building the Data Tools team in India and you will have an opportunity to be part of a founding team with a greater opportunity for impact where you can help grow the team and shape the roadmap for the data platform at DoorDash. You will report directly to the Data Tools Engineering Manager.You're excited about this opportunity because you will…      Work on building a data discovery platform, privacy frameworks, unified access control frameworks, and data quality platform to enable data builders at DoorDash to deliver high-quality and trustable data sets and metricsHelp accelerate the adoption of the data discovery platform by building integrations across online, analytics platforms and promoting self-serveCome up with solutions for scaling data systems for various business needsCollaborate in a dynamic startup environment\nWe're excited about you because…      B.E./B.Tech., M.E./M.Tech, or Ph.D. in Computer Science or equivalent2+ years of experience with CS fundamental concepts and experience with at least one of the programming languages of Scala, Java, and PythonPrior technical experience in Big Data infrastructure & governance - you've built meaningful pieces of data infrastructure. Bonus if those were open-sourced technologies like DataHub, Spark, Airflow, Kafka, FlinkExperience improving efficiency, scalability, and stability of data platforms\nWe use Covey as part of our hiring and / or promotional process for jobs in NYC and certain features may qualify it as an AEDT. As part of the evaluation process we provide Covey with job requirements and candidate submitted applications. We began using Covey Scout for Inbound on June 20, 2024.Please see the independent bias audit report covering our use of Covey here.About DoorDashAt DoorDash, our mission to empower local economies shapes how our team members move quickly, learn, and reiterate in order to make impactful decisions that display empathy for our range of users—from Dashers to merchant partners to consumers. We are a technology and logistics company that started with door-to-door delivery, and we are looking for team members who can help us go from a company that is known for delivering food to a company that people turn to for any and all goods.DoorDash is growing rapidly and changing constantly, which gives our team members the",
      "jobId": "4084261319",
      "jobUrl": "https://www.linkedin.com/jobs/view/4084261319"
    },
    {
      "location": "Pune",
      "scrapedAt": "2025-11-13T16:04:36.374Z",
      "title": "Software Engineer, Frontend",
      "company": "DoorDash",
      "description": "About the job\n            \n\n            \n                \n                  About the TeamData is at the foundation of DoorDash's success. The Engineering team in India builds data tools for our internal and external consumers like Data as a Platform (DaaP) solution - which enables merchants and partners to retrieve the data they need from DoorDash and integrate it with their data pipeline, configuration tool which enables configuration management for ETLs, and few other internal tools to solve other data related use cases.About the Role DoorDash is building the world's most reliable on-demand, logistics engine for delivery. We are continuing to grow rapidly and expanding our Engineering offices globally! We are looking for Frontend Engineers to build and maintain large scale data applications and platforms.Frontend Engineers in the data applications space help design and build beautiful, intuitive user interfaces for our web applications to create the best delivery experience possible. Product focused Engineers work at the intersection of product, data platform and data engineering to solve key business problems with elegant technical solutions. You'll work with both technical and business teams to build features that keep our users top of mind. This role is hybrid based in Pune with some in-office time expected and will report to an Engineering Manager.You're excited about this opportunity because you will…      Become a product owner for one of our client facing applications. Write robust, highly tested, well-crafted code that you can be proud of. Fight for the best customer experience through technical and product decisions. \nWe're excited about you because you have…      B.S., M.S. or PhD in relevant field 2+ years of industry experienceUnderstanding of cross-browser compatibility, progressive enhancement and graceful degradation, responsive design, website performance, and accessibility.Experience architecting large-scale frontend applicationsMastery of the foundations of the web: vanilla JS, HTML5, CSS3Deep understanding of REST principles and experience working with and implementing backend APIsExperience with React/Redux, or similar frameworksExperience with documentation, unit and integration testing\nNotice to Applicants for Jobs Located in NYC or Remote Jobs Associated With Office in NYC OnlyWe use Covey as part of our hiring and/or promotional process for jobs in NYC and certain features may qualify it as an AEDT in NYC. As part of the hiring and/or promotion process, we provide Covey with job requirements and candidate submitted applications. We began using Covey Scout for Inbound from August 21, 2023, through December 21, 2023, and resumed using Covey Scout for Inbound again on June 29, 2024.The Covey tool has been reviewed by an independent auditor. Results of the audit may be viewed here: CoveyAbout DoorDashAt DoorDash, our mission to empower local economies shapes how our team members move quickly, learn, and reiterate in order t",
      "jobId": "4248552076",
      "jobUrl": "https://www.linkedin.com/jobs/view/4248552076"
    },
    {
      "location": "Pune",
      "scrapedAt": "2025-11-13T16:04:48.737Z",
      "title": "Software Engineer - Java Fullstack Angular",
      "company": "EPAM Systems",
      "description": "About the job\n            \n\n            \n                \n                  Join our team as a Software Engineer focusing on Java full-stack development with Angular.You will contribute to web and mobile application development using cloud technologies and collaborate on design, development, and production releases. This role offers an opportunity to apply your skills in both front-end and back-end technologies while working with clients. If you are passionate about delivering quality software solutions, we encourage you to apply. Responsibilities      Develop and maintain front-end web applications using Angular, JavaScript, HTML, and CSSImplement back-end services and APIs using Java 8, Spring, Spring Boot, and REST APIDesign and develop microservices architectures to support scalable applicationsCollaborate with cross-functional teams to resolve technical issues in design, development, and productionBuild and maintain CI/CD pipelines to automate deployment processesWrite unit and integration tests using JUnit to ensure software qualityWork closely with clients to understand requirements and deliver high-quality solutionsApply best practices and design patterns in software developmentContribute to continuous improvement of development processes and toolsSupport both server-side and client-side rendering as neededParticipate in code reviews and provide constructive feedbackDocument software components and maintain technical documentationTroubleshoot and debug issues to ensure application performance and reliabilityStay updated with emerging technologies relevant to the projectAssist in deployment and monitoring of applications in cloud environments\n Requirements      3 to 5 years of experience in software development with a focus on Java fullstackProficiency in Java 8 and frameworks such as Spring and Spring BootExperience with front-end technologies including Angular, JavaScript, HTML, and CSSKnowledge of REST API design and implementationBackground in using relational databases such as PostgreSQL or OracleFamiliarity with microservices architecture and cloud-based application developmentSkills in writing unit tests using JUnit or similar frameworksExperience with CI/CD pipelines and version control systemsUnderstanding of common programming design patterns and best practicesCapability to resolve technical problems across design, development, and productionStrong problem-solving skills and attention to detailAbility to communicate effectively in written and verbal EnglishExperience with web development tools and package managers",
      "jobId": "4311470448",
      "jobUrl": "https://www.linkedin.com/jobs/view/4311470448"
    },
    {
      "location": "Pune",
      "scrapedAt": "2025-11-13T16:05:01.052Z",
      "title": "Software Engineer 1",
      "company": "Emerson",
      "description": "About the job\n            \n\n            \n                \n                  Job DescriptionIn This Role, Your Responsibilities Will Be:       Work as part of a team to design, implement and execute both manual and automated product security tests.  Research and develop custom product security test tools.  Participate in reviews of product requirements, test designs, and test implementations.  Work with cross-functional teams to help solve engineering challenges.  Provide technical support for test stations and tooling.  Research and investigate potential vulnerabilities  Support product security activities for local embedded device teams \nWho You Are:      You balance planning with actions. You stay aligned with your goals and stay productive. You take time to ask questions and define the problem and make learning a priority and a goal. You try different solutions for problems and learn from the results. You make new connections and build relationships in other areas and teams but can be an independent self-starter as needed. You are comfortable reaching out to experts on topics you may not fully understand yet. \nFor This Role, You Will Need:       Bachelor's degree in Computer Engineering or Computer Science  2-3 years of applicable experience in cybersecurity and software testing \nPreferred Qualifications That Set You Apart:       Strong critical thinking and problem-solving skills  Ability to be creative to think “outside the box”.  Knowledge of fundamental product security concepts (e.g., CIA triad, secure development, etc.)  Interest and experience performing product security testing (e.g., security requirement testing, pen testing, fuzz testing, bug bounty, etc.)  Interest and experience working with windows and web applications including knowledge of .NET, JavaScript and other windows and web application technologies  Interest and experience working with a variety of tools used for security testing (e.g., Burp, decompilers, etc.)  Familiarity with industry standards and regulations such as IEC 62443 and EU CRA \nOur Culture & Commitment to You:      At Emerson, we are committed to fostering a culture where every employee is valued and respected for their unique experiences and perspectives. We believe a diverse and inclusive work environment contributes to the rich exchange of ideas and diversity of thoughts, that inspires innovation and brings the best solutions to our customers. This philosophy is fundamental to living our company’s values and our responsibility to leave the world in a better place. Learn more about our Culture & Values and about Diversity, Equity & Inclusion at Emerson. If you have a disability and are having difficulty accessing or using this website to apply for a position, please contact: idisability.administrator@emerson.com.",
      "jobId": "4335990462",
      "jobUrl": "https://www.linkedin.com/jobs/view/4335990462"
    },
    {
      "location": "Pune",
      "scrapedAt": "2025-11-13T16:05:13.447Z",
      "title": "Specialist Software Engineer, Actimize",
      "company": "NiCE",
      "description": "About the job\n            \n\n            \n                \n                  At NiCE, we don’t limit our challenges. We challenge our limits. Always. We’re ambitious. We’re game changers. And we play to win. We set the highest standards and execute beyond them. And if you’re like us, we can offer you the ultimate career opportunity that will light a fire within you.Job DescriptionAbout NiCE NICE Ltd. (NASDAQ: NICE) software products are used by 25,000+ global businesses, including 85 of the Fortune 100 corporations, to deliver extraordinary customer experiences, fight financial crime and ensure public safety. Every day, NiCE software manages more than 120 million customer interactions and monitors 3+ billion financial transactions. Known as an innovation powerhouse that excels in AI, cloud and digital, NiCE is consistently recognized as the market leader in its domains, with over 8,500 employees across 30+ countries. NiCE is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, national origin, age, sex, marital status, ancestry, neurotype, physical or mental disability, veteran status, gender identity, sexual orientation or any other category protected by law.",
      "jobId": "4340523027",
      "jobUrl": "https://www.linkedin.com/jobs/view/4340523027"
    },
    {
      "location": "Pune",
      "scrapedAt": "2025-11-13T16:05:25.931Z",
      "title": "Associate Software Engineer",
      "company": "Light & Wonder",
      "description": "About the job\n            \n\n            \n                \n                  iGaming:If it’s iGaming, we know a thing or two. At Light & Wonder, It’s all about the games, and our digital team leads the global iGaming market, providing jaw-dropping content and innovative software that powers the world's most successful online gaming providers.Position SummaryAbout CompanyLight & Wonder is a global leader in game experiences. We create content, hardware and systems that connect iconic titles across any place or channel. By turning games into expansive entertainment, we keep thrilling players with characters and stories they can’t get enough of.Light & Wonder, Inc. is the leading cross-platform global games company. Through our three unique, yet highly complementary business segments, we deliver unforgettable experiences by combining the exceptional talents of our 6,500+ member team, with a deep understanding of our customers and players. We create immersive content that forges lasting connections with players, wherever they choose to engage. At Light & Wonder, it’s all about the games. The Company is committed to the highest standards of integrity, from promoting player responsibility to implementing sustainable practices. To learn more visit www.lnw.com.We are committed to offering very competitive benefits that are aligned with our values and inspire employees to drive innovation and contribute to the organization’s performance. Employees are the most valued resource, and we always look to improve their well-being with a wide range of benefits befitting every individual. Not limited to monetary benefits, we have robust learning and development opportunities that help them to grow professionally.Our Values      Dare to be bold: We combine diverse talent to look at the familiar in unfamiliar ways.Celebrate perspectives - We combine diverse talent to look at the familiar in unfamiliar waysNever settle: We relentlessly push forward to create the extraordinary in every detail.Uphold integrity: We promote accountability and respect to raise the bar for ourselves and the industry.Win as a team: We bring out the best in each other to share collective success.\nAssociate Front-End EngineerJob Location:  Commerzone IT Tech Park, Yerwada - Pune.Required Experience: 1-2 YearJob DescriptionThe Client Engineer works on the frontlines of a game development team to create compelling game experiences for our SG products. You will implement, debug, modify and generally support in-game features, development, and operational tools in a timely manner and actively participate in the design of the games.You will need to have technical skills to operate independently, and the communication and collaboration skills to be an integral and valued team player. At the Software Engineer level, you will need to have the solid skills, experience, and work ethic to succeed as a software engineer, and the desire to learn from your teammates, all while building games that delight our",
      "jobId": "4335900261",
      "jobUrl": "https://www.linkedin.com/jobs/view/4335900261"
    },
    {
      "location": "Pune",
      "scrapedAt": "2025-11-13T16:05:38.450Z",
      "title": "Associate Software Engineer",
      "company": "Light & Wonder",
      "description": "About the job\n            \n\n            \n                \n                  iGaming:If it’s iGaming, we know a thing or two. At Light & Wonder, It’s all about the games, and our digital team leads the global iGaming market, providing jaw-dropping content and innovative software that powers the world's most successful online gaming providers.Position SummaryAbout CompanyLight & Wonder is a global leader in game experiences. We create content, hardware and systems that connect iconic titles across any place or channel. By turning games into expansive entertainment, we keep thrilling players with characters and stories they can’t get enough of.Light & Wonder, Inc. is the leading cross-platform global games company. Through our three unique, yet highly complementary business segments, we deliver unforgettable experiences by combining the exceptional talents of our 6,500+ member team, with a deep understanding of our customers and players. We create immersive content that forges lasting connections with players, wherever they choose to engage. At Light & Wonder, it’s all about the games. The Company is committed to the highest standards of integrity, from promoting player responsibility to implementing sustainable practices. To learn more visit www.lnw.com.We are committed to offering very competitive benefits that are aligned with our values and inspire employees to drive innovation and contribute to the organization’s performance. Employees are the most valued resource, and we always look to improve their well-being with a wide range of benefits befitting every individual. Not limited to monetary benefits, we have robust learning and development opportunities that help them to grow professionally.Our Values      Dare to be bold: We combine diverse talent to look at the familiar in unfamiliar ways.Celebrate perspectives - We combine diverse talent to look at the familiar in unfamiliar waysNever settle: We relentlessly push forward to create the extraordinary in every detail.Uphold integrity: We promote accountability and respect to raise the bar for ourselves and the industry.Win as a team: We bring out the best in each other to share collective success.\nAssociate Front-End EngineerJob Location:  Commerzone IT Tech Park, Yerwada - Pune.Required Experience: 1-2 YearJob DescriptionThe Client Engineer works on the frontlines of a game development team to create compelling game experiences for our SG products. You will implement, debug, modify and generally support in-game features, development, and operational tools in a timely manner and actively participate in the design of the games.You will need to have technical skills to operate independently, and the communication and collaboration skills to be an integral and valued team player. At the Software Engineer level, you will need to have the solid skills, experience, and work ethic to succeed as a software engineer, and the desire to learn from your teammates, all while building games that delight our",
      "jobId": "4335829878",
      "jobUrl": "https://www.linkedin.com/jobs/view/4335829878"
    },
    {
      "location": "Pune",
      "scrapedAt": "2025-11-13T16:05:51.002Z",
      "title": "Associate Software Engineer",
      "company": "Light & Wonder",
      "description": "About the job\n            \n\n            \n                \n                  iGaming:If it’s iGaming, we know a thing or two. At Light & Wonder, It’s all about the games, and our digital team leads the global iGaming market, providing jaw-dropping content and innovative software that powers the world's most successful online gaming providers.Position SummaryAbout CompanyLight & Wonder is a global leader in game experiences. We create content, hardware and systems that connect iconic titles across any place or channel. By turning games into expansive entertainment, we keep thrilling players with characters and stories they can’t get enough of.Light & Wonder, Inc. is the leading cross-platform global games company. Through our three unique, yet highly complementary business segments, we deliver unforgettable experiences by combining the exceptional talents of our 6,500+ member team, with a deep understanding of our customers and players. We create immersive content that forges lasting connections with players, wherever they choose to engage. At Light & Wonder, it’s all about the games. The Company is committed to the highest standards of integrity, from promoting player responsibility to implementing sustainable practices. To learn more visit www.lnw.com.We are committed to offering very competitive benefits that are aligned with our values and inspire employees to drive innovation and contribute to the organization’s performance. Employees are the most valued resource, and we always look to improve their well-being with a wide range of benefits befitting every individual. Not limited to monetary benefits, we have robust learning and development opportunities that help them to grow professionally.Our Values      Dare to be bold: We combine diverse talent to look at the familiar in unfamiliar ways.Celebrate perspectives - We combine diverse talent to look at the familiar in unfamiliar waysNever settle: We relentlessly push forward to create the extraordinary in every detail.Uphold integrity: We promote accountability and respect to raise the bar for ourselves and the industry.Win as a team: We bring out the best in each other to share collective success.\nAssociate Front-End EngineerJob Location:  Commerzone IT Tech Park, Yerwada - Pune.Required Experience: 1-2 YearJob DescriptionThe Client Engineer works on the frontlines of a game development team to create compelling game experiences for our SG products. You will implement, debug, modify and generally support in-game features, development, and operational tools in a timely manner and actively participate in the design of the games.You will need to have technical skills to operate independently, and the communication and collaboration skills to be an integral and valued team player. At the Software Engineer level, you will need to have the solid skills, experience, and work ethic to succeed as a software engineer, and the desire to learn from your teammates, all while building games that delight our",
      "jobId": "4335769892",
      "jobUrl": "https://www.linkedin.com/jobs/view/4335769892"
    },
    {
      "location": "Pune",
      "scrapedAt": "2025-11-13T16:06:03.630Z",
      "title": "Full Stack Engineer",
      "company": "Terra Technology Circle Consulting Private Limited",
      "description": "About the job\n            \n\n            \n                \n                  Job Title: MERN Stack DeveloperExperience: 2–3 yearsLocation: Pune, Bangalore and NoidaEmployment Type: PermanentAbout the RoleWe are looking for a talented MERN Stack Developer to join our development team. The ideal candidate will have hands-on experience building scalable web applications using MongoDB, Express.js, React.js, and Node.js, and a passion for writing clean, efficient code.Key Responsibilities      Develop, test, and maintain full-stack web applications using the MERN stack.Design and implement RESTful APIs and integrate with front-end components.Collaborate with UI/UX designers and backend teams to deliver seamless user experiences.Optimize applications for speed, scalability, and performance.Participate in code reviews, debugging, and deployment activities.Stay updated with emerging technologies and best practices in web development.\nRequired Skills & Qualifications      2–3 years of experience in full-stack development using MERN (MongoDB, Express.js, React.js, Node.js).Strong proficiency in JavaScript (ES6+), HTML, CSS, and related front-end technologies.Experience with version control systems (Git) and RESTful API design.Familiarity with cloud deployment (AWS, Azure, or similar) and CI/CD pipelines is a plus.Good problem-solving skills and ability to work collaboratively in an agile environment.\nWhat We Offer      Competitive salary and benefits package.Opportunity to work on innovative projects with modern technologies.Supportive and collaborative team culture.",
      "jobId": "4340412958",
      "jobUrl": "https://www.linkedin.com/jobs/view/4340412958"
    },
    {
      "location": "Pune",
      "scrapedAt": "2025-11-13T16:06:16.056Z",
      "title": "Node.JS Engineer",
      "company": "Workassist",
      "description": "About the job\n            \n\n            \n                \n                  Work Level: IndividualCore: Result Driven, Adaptable, OrganizedLeadership: Decisive, ResponsiveIndustry Type: Software ProductFunction: Full Stack DeveloperKey Skills: Node JS,Javascript,Fullstack Developer,Spring MVC,Restful Web Services,CI/CD,DockerEducation: GraduateNote: This is a requirement for one of the Workassist Hiring Partner.Key Requirements      At least 8+ years of technology and banking domain experience with significant exposure to digital and mobility platformsAt least 6 years’ and hands on in designing and developing NodeJS microservices in mobility applicationsStrong knowledge and experience of the following technologies:Frontend Native – iOS & AndroidBackend Languages – NodeJS, Java Script, Express NodeJS, Full StackDatabase – Oracle, PostgreSQL,DymanoDBDevelopment Framework – MVC, TDD, ReST APIsTesting Framework – Mocha ChaiCode Review Framework – PrismaExperience with CI/CD pipeline, and automation (Gitlab, Nexus etc.)AWS experience including EC2, EKS, Docker, SQS, SNS, Lambda, Kong API Gateway is a plusExperiences of engineering practices such as code refactoring, design patterns, design-driven development, continuous integration, Dev-Ops, building highly scalable applications, application security.Ability to work effectively with people at all levels in an organizationBeing a participant in technical communities such as external/internal meetups e.g., speak at conferences, author books and blog posts is an advantage\nKey Responsibilities      Responsible for developing and managing mobility backend platforms, QA and Integration services within Fab / Third-party systems,Provide production support for application issues and bug fixesResponsible to ensure development meets business requirements with high qualityWork closely with Service Delivery Manager, Scrum team and Solution Architect to plan and deliver backend application servicesOwnership and accountability of the overall development, preparation of LLD, Release notes and deployment documentsIntroduce and maintain best practices, technologies to ensure product stays on the leading edge of technology.Utilize a mix of open Source and commercial technologies to create the foundation for rapid and cost-effective implementation of systems that maximize value from day one in alignment with the bank’s policies and procedures and in alignment with different teams within the bank.Collaborate and facilitate integration with other teams and products within the bank including risk, security and compliance.\nCompany DescriptionWorkassist is an online recruitment and employment solution platform based in Lucknow, India. We provide relevant profiles to employers and connect job seekers with the best opportunities across various industries. With a network of over 10,000+ recruiters, we help employers recruit talented individuals from sectors such as Banking & Finance, Consulting, Sales & Marketing, HR, IT, Operat",
      "jobId": "4335649509",
      "jobUrl": "https://www.linkedin.com/jobs/view/4335649509"
    },
    {
      "location": "Pune",
      "scrapedAt": "2025-11-13T16:06:28.471Z",
      "title": "Software Engineer",
      "company": "MPencil",
      "description": "About the job\n            \n\n            \n                \n                  Hiring: Freelance Software Developer (Part-Time / Remote)Tech Stack Required: Next.js, React.js, MongoDBExperience: 1 to 3 yearsCompensation: ₹5,000/month (Part-time Freelance)We are looking for a dedicated Freelance Software Developer who is comfortable working on web development tasks and supporting ongoing product development. Ideal for someone who wants consistent monthly freelance work with flexibility.Responsibilities      Frontend development using Next.js / React.jsBackend work with Node.js & MongoDBBug fixing, small feature improvements, UI changesCollaborating with our tech team as neededMust be available for weekly syncs & updates\nRequirements      1–3 years of experience in web developmentStrong hands-on with Next.js and React.jsExperience with REST APIs, Node.js & MongoDBAbility to work independently & deliver on time\nNice to Have      Experience with GitBasic UI/UX understandingFamiliarity with deployment (Vercel / Render / AWS)\nWork Mode      RemoteFlexible hoursLong-term freelance opportunity for the right candidate\n📩 How to Apply:Send your resume to info@mpencil.in",
      "jobId": "4322082753",
      "jobUrl": "https://www.linkedin.com/jobs/view/4322082753"
    },
    {
      "location": "Pune",
      "scrapedAt": "2025-11-13T16:06:40.852Z",
      "title": "Senior Software Engineer",
      "company": "Barclays",
      "description": "About the job\n            \n\n            \n                \n                  Join us as a Senior Software Engineer at Barclays, where you'll take part in the evolution of our digital landscape, driving innovation and excellence. You'll harness cutting-edge technology to revolutionize our digital offerings, ensuring unparalleled customer experiences. As a part of the team, you will deliver technology stack, using strong analytical and problem solving skills to understand the business requirements and deliver quality solutions. You'll be working on complex technical problems that will involve detailed analytical skills and analysis. This will be done in conjunction with fellow engineers, business analysts and business stakeholders.To be successful as a Senior Software Engineer, you should have experience with:      Candidates with good DB knowledge and TWS expertise.Candidate should possess strong expertise in DevOps tools like Jenkins, Bitbucket, Chef, GitLab, Nexus.Additionally having scripting skills in PL/SQL, Unix shell / Python would be an added advantage.Experience in config and Implementation activities.Excellent communication skills [verbal and written] and collaboration skills are essential.Strong Knowledge of cloud infrastructure management and automation technologies (Chef, Terraform etc.).Strong knowledge of scripted and declarative Jenkins pipeline.Expected to implement and maintain automation scripts using shell or Python to support the build and deployment processes.Ability to work independently.\nYou may be assessed on key critical skills relevant for success in role, such as risk and controls, change and transformation, business acumen, strategic thinking and digital and technology, as well as job-specific technical skills.This role is based in Pune.Purpose of the roleTo design, develop, and execute testing strategies to validate functionality, performance, and user experience, while collaborating with cross-functional teams to identify and resolve defects, and continuously improve testing processes and methodologies, to ensure software quality and reliability.Accountabilities      Development and implementation of comprehensive test plans and strategies to validate software functionality and ensure compliance with established quality standards.Creation and execution automated test scripts, leveraging testing frameworks and tools to facilitate early detection of defects and quality issues.         .Collaboration with cross-functional teams to analyse requirements, participate in design discussions, and contribute to the development of acceptance criteria, ensuring a thorough understanding of the software being tested.Root cause analysis for identified defects, working closely with developers to provide detailed information and support defect resolution.Collaboration with peers, participate in code reviews, and promote a culture of code quality and knowledge sharing.Stay informed of industry technology trends and innovations, and act",
      "jobId": "4340231607",
      "jobUrl": "https://www.linkedin.com/jobs/view/4340231607"
    },
    {
      "location": "Mumbai",
      "scrapedAt": "2025-11-13T16:07:26.365Z",
      "title": "Java Full Stack Developer",
      "company": "BNP Paribas",
      "description": "About the job\n            \n\n            \n                \n                  About BNP Paribas India SolutionsEstablished in 2005, BNP Paribas India Solutions is a wholly owned subsidiary of BNP Paribas SA, European Union’s leading bank with an international reach. With delivery centers located in Bengaluru, Chennai and Mumbai, we are a 24x7 global delivery center. India Solutions services three business lines: Corporate and Institutional Banking, Investment Solutions and Retail Banking for BNP Paribas across the Group. Driving innovation and growth, we are harnessing the potential of over 10000 employees, to provide support and develop best-in-class solutions.About BNP Paribas GroupBNP Paribas is the European Union’s leading bank and key player in international banking. It operates in 65 countries and has nearly 185,000 employees, including more than 145,000 in Europe. The Group has key positions in its three main fields of activity: Commercial, Personal Banking & Services for the Group’s commercial & personal banking and several specialized businesses including BNP Paribas Personal Finance and Arval; Investment & Protection Services for savings, investment, and protection solutions; and Corporate & Institutional Banking, focused on corporate and institutional clients. Based on its strong diversified and integrated model, the Group helps all its clients (individuals, community associations, entrepreneurs, SMEs, corporate and institutional clients) to realize their projects through solutions spanning financing, investment, savings and protection insurance. In Europe, BNP Paribas has four domestic markets: Belgium, France, Italy, and Luxembourg. The Group is rolling out its integrated commercial & personal banking model across several Mediterranean countries, Turkey, and Eastern Europe. As a key player in international banking, the Group has leading platforms and business lines in Europe, a strong presence in the Americas as well as a solid and fast-growing business in Asia-Pacific. BNP Paribas has implemented a Corporate Social Responsibility approach in all its activities, enabling it to contribute to the construction of a sustainable future, while ensuring the Group's performance and stabilityCommitment to Diversity and InclusionAt BNP Paribas, we passionately embrace diversity and are committed to fostering an inclusive workplace where all employees are valued, respected and can bring their authentic selves to work. We prohibit Discrimination and Harassment of any kind and our policies promote equal employment opportunity for all employees and applicants, irrespective of, but not limited to their gender, gender identity, sex, sexual orientation, ethnicity, race, colour, national origin, age, religion, social status, mental or physical disabilities, veteran status etc. As a global Bank, we truly believe that inclusion and diversity of our teams is key to our success in serving our clients and the communities we operate in.About Business Line/Fun",
      "jobId": "4335862338",
      "jobUrl": "https://www.linkedin.com/jobs/view/4335862338"
    },
    {
      "location": "Mumbai",
      "scrapedAt": "2025-11-13T16:07:38.812Z",
      "title": "Junior Software Developer",
      "company": "Linfox Asia",
      "description": "About the job\n            \n\n            \n                \n                  Linfox is a leading third-party Logistics provider in the Asia Pacific region. We are seeking a motivated and enthusiastic Junior .NET Developer with 0 to 2 years of experience to join our expanding development team. The successful candidate will possess a strong foundation in C# and NET technologies, along with practical exposure to Flutter or Flutter Flow for cross-platform mobile application development. This entry-level position provides an excellent opportunity to develop skills, contribute to impactful projects, and collaborate within a professional and supportive environment focused on both web and mobile solutions.Responsibilities:       Develop, maintain, and support applications using .NET Core / ASP.NET.Assist in designing and implementing RESTful APIs and backend services.Collaborate with senior developers to write clean, maintainable, and efficient code.Contribute to front-end development using Flutter for mobile applications. (Android/iOS).Work closely with QA, UI/UX, and product teams to ensure high-quality deliverables.Participate in code reviews and team knowledge-sharing sessions.\nQualifications and experiences:       Bachelor’s degree in computer science, IT, or a related field (or equivalent practical).Proficiency in C# and .NET Core.Experience with Entity Framework / LINQ.Understanding of OOP principles, data structures, and algorithms.Exposure to Flutter or Flutter Flow for mobile app development.Familiarity with SQL databases (MS SQL Server, MySQL, or PostgreSQL).Basic understanding of version control systems (Git).Strong problem-solving and communication skills.Exposure to SPA frameworks like React and .NET BlazorKnowledge of JavaScript, HTML, CSS, Bootstrap.Understanding of Agile/Scrum methodologies.Experience with cloud platforms (Azure/AWS).Familiarity with CI/CD pipelines.\nIf you are interested in this opportunity, please apply via this LinkedIn post.",
      "jobId": "4335708424",
      "jobUrl": "https://www.linkedin.com/jobs/view/4335708424"
    },
    {
      "location": "Mumbai",
      "scrapedAt": "2025-11-13T16:07:51.257Z",
      "title": "Development Specialist",
      "company": "Datacore Technologies",
      "description": "About the job\n            \n\n            \n                \n                  Total Yrs. of Experience: 5-8 YearsRelevant Yrs. of experience: 5 YearsDomain: FSMandatory skills:      PythonAWSPL/SQLBasic DevOpsRPA\nWork Location:      PuneHyderabadBangalore\nMode of Interview: VirtualMode of work: Hybrid",
      "jobId": "4320681345",
      "jobUrl": "https://www.linkedin.com/jobs/view/4320681345"
    },
    {
      "location": "Mumbai",
      "scrapedAt": "2025-11-13T16:07:57.425Z",
      "title": "JDE S&D Functional (WALKIN)",
      "company": "Tata Consultancy Services",
      "description": "About the job\n            \n\n            \n                \n                  Greetings from TCS Recruitment Team!For all those JDE S&D Functional we are coming bigger with the plan of Walk In Drive on 08-Nov-2025 (Saturday) in PUNE Locations.It is a Walk in Drive planned to attract great Talents in JDE S&D Functional. We believe that your skills and expertise are a better match for the skills we are looking for.Skill: JDE S&D Functional (WALKIN)Years of experience: 5 to 14 YearsWalk-In-Drive Location: PuneDate: 08-Nov-2025 (Walkin)Drive Time: 9AM to 1:00 PMWalk-in-Location Details: TCS Sahyadri Park is Sahyadri Park, Plot No. 2 & 3, Phase 3, Hinjewadi Rajiv Gandhi Infotech Park, Pune - 411057, MaharashtraJob Description:      JDE Implementation, Support and development experience on JD Edwards EnterpriseOne 9.2 version.JDE Modules: Experience in Sales Order Management, Advanced Pricing, Inventory Management, Procurement, Transportation, Warehouse Management.Analyze functional issues and provide resolution including workarounds.Emergency data fixes.Perform root cause analysis.Coordinate with business process owners/SMEs for support and development activities.Coordinate with technical team.Prioritize incidents.",
      "jobId": "4320363327",
      "jobUrl": "https://www.linkedin.com/jobs/view/4320363327"
    },
    {
      "location": "Mumbai",
      "scrapedAt": "2025-11-13T16:08:03.640Z",
      "title": "Backend Engineer (Contractual)",
      "company": "Uplers",
      "description": "About the job\n            \n\n            \n                \n                  Experience: 2.00 + yearsSalary: INR 148148-222222 / month (based on experience)Expected Notice Period: 7 DaysShift: (GMT+05:30) Asia/Kolkata (IST)Opportunity Type: RemotePlacement Type: Full Time Contract for 6 Months(40 hrs a week/160 hrs a month)(*Note: This is a requirement for one of Uplers' client - Lyzr)What do you need for this opportunity?Must have skills required:Python, Django, FastAPI, Generative AI, Microservices, Restful APIs, Mongo DB, AWSLyzr is Looking for: What You’ll Do :      Design and develop backend services that power GenAI applications and platformsBuild APIs and infrastructure to support LLM-based features, tools, and agent workflowsCollaborate with frontend, ML, and product teams to create seamless AI experiencesOptimize backend systems for performance, scalability, and reliabilityWork with vector databases, data pipelines, and AI model endpoints (OpenAI, Anthropic, Hugging Face, etc.)Maintain clean, secure, and production-grade codeContribute to the architecture and roadmap of our GenAI stack\nWhat We’re Looking For :      2+ years of experience in backend developmentProficient in Python (Django/fastAPI)Strong experience with REST APIs, microservices, and scalable cloud infrastructureExperience building or supporting GenAI applications and/or LLM-powered productsComfortable working with vector databases (e.g., Pinecone, Weaviate, FAISS) and RAG pipelinesExposure to cloud services (AWS, GCP, or Azure) and containerization (Docker, Kubernetes)Excellent problem-solving, communication, and collaboration skills\nInterview Process :      Assessment Technical Round -1Technical Round -2\nHow to apply for this opportunity?      Step 1: Click On Apply! And Register or Login on our portal.Step 2: Complete the Screening Form & Upload updated ResumeStep 3: Increase your chances to get shortlisted & meet the client for the Interview!\nAbout Uplers:Our goal is to make hiring reliable, simple, and fast. Our role will be to help all our talents find and apply for relevant contractual onsite opportunities and progress in their career. We will support any grievances or challenges you may face during the engagement.(Note: There are many more opportunities apart from this on the portal. Depending on the assessments you clear, you can apply for them as well).So, if you are ready for a new challenge, a great work environment, and an opportunity to take your career to the next level, don't hesitate to apply today. We are waiting for you!",
      "jobId": "4332778344",
      "jobUrl": "https://www.linkedin.com/jobs/view/4332778344"
    },
    {
      "location": "Mumbai",
      "scrapedAt": "2025-11-13T16:08:09.841Z",
      "title": "Sales Consultant",
      "company": "InnovationM",
      "description": "About the job\n            \n\n            \n                \n                  We are seeking a dynamic and driven Senior Sales Consultant with 2.5 year to 4 years of B2B sales experience, preferably in CRM or HR Tech. In this role, you will be at the forefront of driving growth by identifying opportunities, building relationships with key decision-makers, and offering strategic solutions aligned with our vision of transforming the hiring process.Role and ResponsibilitiesDrive end-to-end B2B sales, from lead generation to deal closure.Develop and execute a strategic sales plan to achieve revenue targets.Build and maintain strong relationships with HR and talent acquisition leaders.Understand client hiring challenges and position FoxMatrix’s solution effectively.Conduct product demos and articulate value propositions clearly.Collaborate closely with marketing and product teams to align go-to-market strategies.Maintain accurate records of sales activities and pipeline in CRM tools.Stay updated on market trends, competition, and HR tech innovation.Requirements2.5 –4 years of proven experience in B2B sales, preferably in SaaS, CRM, HR Tech, or recruitment solutions.Strong understanding of the recruitment and assessment tools.Excellent communication, negotiation, and presentation skills.Ability to work in a fast-paced, startup environment with minimal supervision.Customer-first mindset with a knack for solution selling.Bachelor's degree in Business, Marketing, or a related field.Prior exposure to enterprise sales or consultative selling approaches.Network within HR or Talent Acquisition verticals.",
      "jobId": "4331155504",
      "jobUrl": "https://www.linkedin.com/jobs/view/4331155504"
    },
    {
      "location": "Mumbai",
      "scrapedAt": "2025-11-13T16:08:16.024Z",
      "title": "React Engineer",
      "company": "Codewinglet Private Limited",
      "description": "About the job\n            \n\n            \n                \n                  Job Title : React Engineer (1+ Years of Experience)Job Description:We are seeking a passionate and skilled React Engineer with over 1 year of experience to join our team. The ideal candidate will have hands-on experience building dynamic and responsive web applications using React.js. This role requires a strong understanding of front-end development principles and the ability to deliver high-quality, scalable solutions in a collaborative environment.Key Responsibilities      :Develop, maintain, and optimize web applications using React.js.Create reusable and modular components to ensure consistency and efficiency in development.Collaborate with designers and backend developers to implement user-friendly features.Debug and troubleshoot application issues to enhance performance and user experience.Integrate APIs and manage state effectively using tools like Redux, Context API, or React Query.Ensure responsive design and cross-browser compatibility for seamless user experiences.Write clean, well-documented, and maintainable code.Stay up-to-date with the latest React and front-end development trends\n.Core Proficienc      y:Strong understanding of JavaScript (ES6+).Proficiency in React.js and its core principles, including JSX, hooks, and lifecycle methods.Experience with state management libraries like Redux, Context API, or React Query.Proficiency in styling in the component.Familiarity with Tailwind CSS for efficient UI development and responsive design.Experience with CSS-in-JS libraries like Styled-Components or Emotion is a plus.Familiarity with Next.js for server-side rendering (SSR), static site generation (SSG), and routing capabilities.Hands-on experience integrating RESTful APIs or GraphQL into React applications.Proficient in Git for version control and collaborative development.Basic understanding of testing frameworks like Jest, React Testing Library, or Cypress.Understanding of code splitting, lazy loading, and performance optimization technique\ns.",
      "jobId": "4322205667",
      "jobUrl": "https://www.linkedin.com/jobs/view/4322205667"
    },
    {
      "location": "Mumbai",
      "scrapedAt": "2025-11-13T16:08:22.194Z",
      "title": "Digital Marketing Manager",
      "company": "Leemboodi",
      "description": "About the job\n            \n\n            \n                \n                  Salary Calibre: 35-45kResponsibilities:      Manage all digital marketing channels such as Facebook, Instagram and LinkedInStay up to date with the latest technology and best practicesMeasure ROI and KPIsOversee all the company's social media accountsManage and improve online content, considering presence with Google AnalyticsBuild an inbound marketing planForecast sales performance trendsMonitor competition and provide suggestions for improvement\nRequirements:      Good knowledge of all different digital marketing channelsGood knowledge and experience with online marketing tools and best practicesFamiliarity with web designSense of ownership and pride in your performance and its impact on a company’s successCritical thinker and problem-solving skillsTeam playerGood time-management skillsGreat interpersonal and communication skills",
      "jobId": "4334175730",
      "jobUrl": "https://www.linkedin.com/jobs/view/4334175730"
    },
    {
      "location": "Gurugram",
      "scrapedAt": "2025-11-13T16:09:07.670Z",
      "title": "Full Stack Engineer",
      "company": "Paisabazaar",
      "description": "About the job\n            \n\n            \n                \n                  Job Description – MERN Stack DeveloperWe are looking for a skilled MERN Stack Developer to join our dynamic team. The ideal candidate should have hands-on experience in MongoDB, Express.js, React.js, and Node.js, with strong problem-solving skills and a passion for building scalable web applications.Key Responsibilities      Develop, test, and deploy full-stack web applications using the MERN stackCollaborate with cross-functional teams to define and deliver new featuresOptimize application performance and ensure responsivenessMaintain code quality, organization, and automation\nRequirements      Strong proficiency in JavaScript (ES6+), React.js, Node.js, and Mongo DB.Experience with RESTful APIs and version control (Git).Good understanding of front-end and back-end architecture.",
      "jobId": "4340455030",
      "jobUrl": "https://www.linkedin.com/jobs/view/4340455030"
    },
    {
      "location": "Gurugram",
      "scrapedAt": "2025-11-13T16:09:19.974Z",
      "title": "Software Engineer in Test",
      "company": "Kavish Technology Pvt Ltd",
      "description": "About the job\n            \n\n            \n                \n                  About the Role:We are looking for a detail-oriented and passionate QA Engineer to join our team. The ideal candidate will be responsible for ensuring the quality, reliability, and performance of our applications through manual and automated testing. You will work closely with the development team to identify, reproduce, and resolve bugs, ensuring a smooth and flawless user experience.Key Responsibilities:      Design, develop, and execute manual and automated test cases.Perform functional, regression, integration, and performance testing.Identify, document, and track defects using tools like JIRA, Bugzilla, or similar.Collaborate with developers and product managers to understand requirements and provide feedback.Ensure applications meet quality standards and comply with company guidelines.Create and maintain test documentation, including test plans, test cases, and test reports.Participate in daily stand-ups, sprint planning, and review meetings.Continuously enhance testing processes and improve automation coverage.\nRequired Skills and Qualifications:      Bachelor’s degree in Computer Science, Engineering, or a related field.Proven experience as a QA Engineer, QA Tester, or similar role.Strong understanding of software QA methodologies, tools, and processes.Experience in manual testing and exposure to automation frameworks (e.g., Selenium, Cypress, Playwright).Familiarity with API testing tools like Postman or RestAssured.Hands-on experience with SQL and basic database validation.Good understanding of SDLC and Agile methodologies.Excellent analytical, problem-solving, and communication skills.\nPreferred Skills (Nice to Have):      Knowledge of CI/CD tools (e.g., Jenkins, GitHub Actions).Experience with performance testing tools like JMeter or LoadRunner.Exposure to cloud platforms (AWS, Azure) and containerization (Docker, Kubernetes).ISTQB Certification or similar QA certification.\nWhy Join Us?      Opportunity to work on cutting-edge technologies.Collaborative and growth-driven environment.Competitive compensation and performance-based rewards.Flexible working hours and supportive team culture.",
      "jobId": "4322238732",
      "jobUrl": "https://www.linkedin.com/jobs/view/4322238732"
    },
    {
      "location": "Gurugram",
      "scrapedAt": "2025-11-13T16:09:32.346Z",
      "title": "Technical Architect",
      "company": "Synaxis Informatic Tech Solutions",
      "description": "About the job\n            \n\n            \n                \n                  We are seeking a seasoned Technical Architect with 12+ years of hands-on experience to lead the design and development of scalable enterprise solutions. This is a critical role for candidates with deep technical expertise in backend development, cutting-edge cloud and microservices architectures, SaaS/B2B platforms, and modern DevOps and AI/ML practices. Required Skills & Qualifications*12–18 years of experience as a solution or technical architect in high-growth product or platform environments*Advanced expertise in backend architecture (Node.js, Python), microservices, APIs, and cloud infrastructure*Hands-on experience with Docker, container orchestration, and CI/CD automation (Jenkins, GitLab CI, etc.)*Experience integrating and optimizing AI/ML solutions in enterprise products*B2B/SaaS platform architecture and scaling knowledge*Strong understanding of DevOps, infrastructure as code (Terraform, Ansible), and security best practices*Excellent analytical, communication, and leadership skills*Bachelor’s/Master’s in Computer Science, Engineering, or related field\n                \n                \n                Desired Skills and Experience\n                \n                  backend development , microservices , Docker , Node.js , Python , AI/ML , cloud , APIs , DevOps , SaaS/B2B platforms , analytical skills , communication skills , leadership skills",
      "jobId": "4336042055",
      "jobUrl": "https://www.linkedin.com/jobs/view/4336042055"
    },
    {
      "location": "Gurugram",
      "scrapedAt": "2025-11-13T16:09:44.658Z",
      "title": "Application Developer",
      "company": "apexanalytix",
      "description": "About the job\n            \n\n            \n                \n                  About Usapexanalytix is the leading provider of trusted supplier data; supplier portal software; controls, audit and analytics software; and AP recovery audit services. We protect over $5 trillion in spend and prevent or recover over $3 billion in overpayments annually, and our client portals actively support over 3 million suppliers. Our software and audit services are built on our SmartVM® database of over 20 million supplier records with contacts, scored for accuracy and age, based on integration with over 650 external data sources and over 10 million communications with suppliers each year. apexanalytix Archimedes™, an advanced cognitive technology and innovation system, supported by IBM Watson®, is integrated into apexanalytix software and services to harness the power of the future through smarter recoveries, controls, analytics, working capital and supplier data. We serve over 250 Fortune 500/Forbes Global 2000 clients around the world and are fluent in languages covering 98 percent of global trade.Our CultureAt apexanalytix, our culture drives everything! We live our culture of performance, respect, candor, and fun—in that order. Performance is measured by delivering value to our clients, generating goodwill, trust, and partnership. Sincere respect for each other, our diverse backgrounds and our well-being are our cornerstones. We value open and honest relationships with each other, our clients, and our communities. And life is too short to not have fun! We look for team players who possess the qualities of being humble, hungry, and smart. We recruit candidates who will strive for accountability in performance and career growth, serving our clients in long-term respectful relationships, and working in a diverse and caring environment.The PerksWe owe our growing success to our team of bright, passionate, and innovative individuals. We truly value our associates and strive to provide the highest quality benefits program, offering competitive compensation packages with tailored bonus plans and generous benefits. Our benefits include health and insurance plans (medical, dental, optical, life insurance, disability insurance, FSA, HSA employee assistance program, supplemental insurance options and pre-paid legal), a generous paid time off plan, 401k plan, flexible work schedules, wellness programs (company fitness and weight loss challenges, financial wellness software tool, and gym membership stipend), associate and customer referral bonus programs, and paid community hours. And here at apexanalytix, you won’t get lost in the shuffle. Our focus on internal training, growth, and development results in annually filling over a quarter of our open positions with internal promotions! With resources such as a strong Mentor Program, Internal Training Portal, plus Education, Tuition, and Certification Assistance, we provide tools for our associates to grow and develop. If you ",
      "jobId": "4273272452",
      "jobUrl": "https://www.linkedin.com/jobs/view/4273272452"
    },
    {
      "location": "Gurugram",
      "scrapedAt": "2025-11-13T16:09:57.014Z",
      "title": "Application Engineer - Products",
      "company": "Sterlite Electric",
      "description": "About the job\n            \n\n            \n                \n                  Purpose of RolePosition TitlePosition SummaryWhat we promise youPosition DemandsKey Accountabilities / ResponsibilitiesCompetenciesBehavioural - Achievement OrientationBehavioural - Altrocentric LeadershipBehavioural - Analytical Decision MakingBehavioural - Customer Service OrientationBehavioural - Impact and InfluenceBehavioural - Information SeekingBehavioural - InitiativeBehavioural - Innovative ThinkingFunctional - FinancialFunctional - OperationalFunctional - PeopleFunctional - Strategic",
      "jobId": "4338184057",
      "jobUrl": "https://www.linkedin.com/jobs/view/4338184057"
    },
    {
      "location": "Gurugram",
      "scrapedAt": "2025-11-13T16:10:09.381Z",
      "title": "Full Stack Engineer",
      "company": "Yaper",
      "description": "About the job\n            \n\n            \n                \n                  Company DescriptionYaper is an innovative platform that transforms credit card usage by helping individuals turn liabilities into assets. Through strategic management of credit cards, Yaper empowers users to generate secondary income streams. With a user-focused approach, Yaper aims to revolutionize personal finance and financial freedom for its growing user base.Role DescriptionThis is a full-time on-site role for a Full Stack Engineer based in Gurugram. In this role, you will be responsible for both front-end and back-end development, ensuring seamless integration and functionality of Yaper’s platform. You will work on software development tasks, troubleshoot issues, write and test code, and collaborate with cross-functional teams to deliver optimal user experiences. This position requires hands-on involvement in creating responsive and efficient applications that align with our mission to enhance financial literacy and independence.Role OverviewWe’re hiring a Full Stack Engineer with 2–3 years of experience to build and scale our next-gen fintech and commerce systems. You’ll work directly with our founding and product teams to design, develop, and deploy features that impact thousands of users.Your Responsibilities      Build and maintain end-to-end features across frontend and backend.Develop dynamic and responsive UIs using React Native (Expo) and JavaScript/CSS.Architect scalable APIs using Ruby on Rails.Ensure system stability, reliability, and scalability.Integrate third-party services (Meta, Google Analytics, WebEngage, Branch, Bedrock, etc.).Use AWS, Docker, and Sentry for deployment, monitoring, and debugging.Collaborate with designers, PMs, and stakeholders for high-speed execution.Write clean, modular, testable code — and care about the product as much as the code.\nTech StackFrontend: JavaScript, CSS, React Native (Expo) Backend: Ruby, Ruby on Rails Database: PostgreSQL, ElasticSearch Hosting: AWS Tools & Infra: GitHub, Sentry, Docker Integrations: Meta, Google Analytics, WebEngage, Branch, Bedrock, AIWhat We’re Looking For      2–3 years of professional Full Stack experience.Strong grasp of Ruby on Rails and React Native.Working knowledge of PostgreSQL, ElasticSearch, and AWS.Problem-solving mindset and attention to performance.Solid understanding of API architecture and CI/CD pipelines.Ownership mentality — we love builders, not executors.Bonus: prior app development or AI integration experience.\nPersonal Skills We Value      Communication with stakeholdersTime management & reliabilityHustle culture mindset — ship fast, improve fasterAnalytical & problem-solving abilityFocus on stability and scalability\nPerks & Benefits      Flexible working hoursLenient leave policy (no fixed leaves — task delivery matters most)Annual team outingMajor control over projectsCompetitive compensationFast learning environment with real product impact. \nUse this HACK to Get Noti",
      "jobId": "4322151084",
      "jobUrl": "https://www.linkedin.com/jobs/view/4322151084"
    },
    {
      "location": "Gurugram",
      "scrapedAt": "2025-11-13T16:10:21.848Z",
      "title": "Full Stack Developer",
      "company": "CirclePe",
      "description": "About the job\n            \n\n            \n                \n                  Company Description:CirclePe is transforming India’s rental landscape by removing the burden of security deposits. As an exclusive club for trustworthy tenants, CirclePe enables members to move into their dream homes with zero-security deposits.Backed by OTP Ventures, IIT Delhi, and the founders of BharatPe and Paytm, CirclePe is building a trusted, transparent, and accessible renting ecosystem.Headquartered in Gurugram, we’re a team driven by innovation, trust, and impact.Role: Full Stack DeveloperLocation: On-site, GurugramType: Full-timeCompensation: ₹5.5 – ₹9 LPAQualifications:- Proficiency in Full-Stack Development front-end and back-end.- Strong understanding of core web technologies.-Experience with modern front-end frameworks (React, Next.js, or similar).- Experience with Node.js, NestJS, or Express.js for backend development.- Familiarity with databases like MongoDB, PostgreSQL, or MySQL.- Familiarity with cloud services(AWS, GCP).- Strong problem-solving and debugging skills.- Ability to work collaboratively in an agile team environment.- Prior experience in fintech is a plus.got any queries?drop here at akash@circlepe.com",
      "jobId": "4322165879",
      "jobUrl": "https://www.linkedin.com/jobs/view/4322165879"
    },
    {
      "location": "Gurugram",
      "scrapedAt": "2025-11-13T16:10:34.199Z",
      "title": "Application Developer",
      "company": "ThoughtSol Infotech Ltd.",
      "description": "About the job\n            \n\n            \n                \n                  Job DescriptionWe are looking for a Full Stack ASP.NET (MVC & Web API) developer along with .net Coreunderstanding. The candidate should be able to develop and support existing and newapplications.The scope of work will include everything from back-end to client-side code, usingoptimal and efficient technologies, frameworks, and patterns. Your primaryresponsibilities will be to design and develop these applications.Responsibilities• Delivering a high-quality application• Integrating with front-end developers• Ensuring a required level of performance• Supporting and fixing existing functionality• Selecting and using the most appropriate and efficient technologies for aparticular application• Designing and building application layersSkills• Proficiency in C#• Experience using .NET 4.5+ | Core• Experience in developing ASP.NET MVC | ASP.NET Core MVC applications• Senior knowledge of Entity Framework 6.* | EF Core | NHibernate | ADO.NET• Good to have knowledge in MSSQL | MySQL | Oracle | Mongo• Understanding of HTML, JS, and CSS• Familiarity with the client side framework jQuery | JavaScript | React",
      "jobId": "4340512534",
      "jobUrl": "https://www.linkedin.com/jobs/view/4340512534"
    },
    {
      "location": "Gurugram",
      "scrapedAt": "2025-11-13T16:10:46.564Z",
      "title": "Custom Software Engineer",
      "company": "Accenture services Pvt Ltd",
      "description": "About the job\n            \n\n            \n                \n                  Project Role : Custom Software EngineerProject Role Description : Develop custom software solutions to design, code, and enhance components across systems or applications. Use modern frameworks and agile practices to deliver scalable, high-performing solutions tailored to specific business needs.Must have skills : Salesforce Lightning Web ComponentsGood to have skills : NAMinimum 2 Year(s) Of Experience Is RequiredEducational Qualification : 15 years full time educationSummary: As an Application Developer, you will design, build, and configure applications to meet business process and application requirements. A typical day involves collaborating with team members to understand project needs, developing innovative solutions, and ensuring that applications are aligned with business objectives. You will engage in problem-solving discussions and contribute to the overall success of the projects you are involved in, while also focusing on continuous improvement and learning within the role. Roles & Responsibilities: - Expected to perform independently and become an SME. - Required active participation/contribution in team discussions. - Contribute in providing solutions to work related problems. - Assist in the documentation of application processes and workflows. - Engage in code reviews to ensure quality and adherence to best practices. Professional & Technical Skills: - Must To Have Skills: Proficiency in Salesforce Lightning Web Components. - Experience with Apex programming and Salesforce APIs. - Strong understanding of web development technologies such as HTML, CSS, and JavaScript. - Familiarity with Salesforce data models and security features. - Experience in developing responsive user interfaces. Additional Information: - The candidate should have minimum 2 years of experience in Salesforce Lightning Web Components. - This position is based at our Gurugram office. - A 15 years full time education is required.",
      "jobId": "4322123093",
      "jobUrl": "https://www.linkedin.com/jobs/view/4322123093"
    },
    {
      "location": "Gurugram",
      "scrapedAt": "2025-11-13T16:10:58.918Z",
      "title": "Development Specialist",
      "company": "Datacore Technologies",
      "description": "About the job\n            \n\n            \n                \n                  Total Yrs. of Experience: 5-8 YearsRelevant Yrs. of experience: 5 YearsDomain: FSMandatory skills:      PythonAWSPL/SQLBasic DevOpsRPA\nWork Location:      PuneHyderabadBangalore\nMode of Interview: VirtualMode of work: Hybrid",
      "jobId": "4320681345",
      "jobUrl": "https://www.linkedin.com/jobs/view/4320681345"
    },
    {
      "location": "Gurugram",
      "scrapedAt": "2025-11-13T16:11:05.151Z",
      "title": "JDE S&D Functional (WALKIN)",
      "company": "Tata Consultancy Services",
      "description": "About the job\n            \n\n            \n                \n                  Greetings from TCS Recruitment Team!For all those JDE S&D Functional we are coming bigger with the plan of Walk In Drive on 08-Nov-2025 (Saturday) in PUNE Locations.It is a Walk in Drive planned to attract great Talents in JDE S&D Functional. We believe that your skills and expertise are a better match for the skills we are looking for.Skill: JDE S&D Functional (WALKIN)Years of experience: 5 to 14 YearsWalk-In-Drive Location: PuneDate: 08-Nov-2025 (Walkin)Drive Time: 9AM to 1:00 PMWalk-in-Location Details: TCS Sahyadri Park is Sahyadri Park, Plot No. 2 & 3, Phase 3, Hinjewadi Rajiv Gandhi Infotech Park, Pune - 411057, MaharashtraJob Description:      JDE Implementation, Support and development experience on JD Edwards EnterpriseOne 9.2 version.JDE Modules: Experience in Sales Order Management, Advanced Pricing, Inventory Management, Procurement, Transportation, Warehouse Management.Analyze functional issues and provide resolution including workarounds.Emergency data fixes.Perform root cause analysis.Coordinate with business process owners/SMEs for support and development activities.Coordinate with technical team.Prioritize incidents.",
      "jobId": "4320363327",
      "jobUrl": "https://www.linkedin.com/jobs/view/4320363327"
    },
    {
      "location": "Gurugram",
      "scrapedAt": "2025-11-13T16:11:11.356Z",
      "title": "Senior Engineer - AI-Powered Search",
      "company": "Uplers",
      "description": "About the job\n            \n\n            \n                \n                  Experience: 4.00 + yearsSalary: INR 3000000.00 / year (based on experience)Expected Notice Period: 7 DaysShift: (GMT+05:30) Asia/Kolkata (IST)Opportunity Type: RemotePlacement Type: Full Time Permanent position(Payroll and Compliance to be managed by: Crop.Photo)(*Note: This is a requirement for one of Uplers' client - A US-based, venture-funded company transforming eCommerce visuals with AI-powered bulk photo editing)What do you need for this opportunity?Must have skills required:media transformation, proxy generation, video ingest, AI/MLOps, Database architecture, ECS (GPU), AWSA US-based, venture-funded company transforming eCommerce visuals with AI-powered bulk photo editing is Looking for: What You’ll Own      Architect the next-gen search and metadata foundation for Evolphin ZoomLead integration of LLM-generated media embeddings into a unified semantic + similarity + structured search experienceCollaborate with ML team to operationalize multimodal AI pipelines that extract visual, audio, and textual data from media assets — from face/logo detection to transcript embeddings to LLM driven media summariesReplace or refactor the current object store and metadata engine with a scalable, multi-tenant architecture in AWSDesign APIs and storage schemas that support:Time-coded media tags (e.g., logos, faces, speech)Structured attributes (e.g., IPTC, EXIF, DRM usage rights, category etc)AI-derived embeddings and semantic summariesDrive the full lifecycle: schema design, vector indexing, embedding integration, and rollout to productionCollaborate with AI/ML and UX teams to power real-time, intuitive media search\nSkills & Experience      Database Architecture, AI/MLOps, AWS (Required) Hands-on experience in DB design and architecture (2-3 yrs)Experience with designing asset metadata schemas in MAM/DAM-like systemsExperience modeling object-style relationships (asset versions time-coded data)Experience with schema-less and structured stores like DynamoDB, PostgreSQL, or AuroraFamiliarity with designing systems that support live and archived media (tiered storage)Hands-on experience with vector databases like Weaviate, Qdrant, FAISS, or Pinecone (2-3 yrs) Familiarity with hybrid search (structured filters + semantic vectors)Familiarity with performance tuning of semantic search (indexing, recall, latency, memory)Experience migrating from monolithic or tightly coupled Java systems to service-oriented designs Ability to work with AI outputs across multiple modalities — aligning embeddings, timestamps, and metadata for unified retrieval (2 years) Experience building services on ECS (GPU), Lambda, API Gateway, SQS/EventBridge (2-3 yrs)Experience with deploying scalable ML services on EC2, Fargate (2 yrs)Strong CI/CD practices (2-3 yrs)Comfort working across Java and Python boundaries when modernizing APIs or data models\nAdditional Skills & Experience      Familiarity with video inges",
      "jobId": "4332937464",
      "jobUrl": "https://www.linkedin.com/jobs/view/4332937464"
    },
    {
      "location": "Gurugram",
      "scrapedAt": "2025-11-13T16:11:17.544Z",
      "title": "Sales Consultant",
      "company": "InnovationM",
      "description": "About the job\n            \n\n            \n                \n                  We are seeking a dynamic and driven Senior Sales Consultant with 2.5 year to 4 years of B2B sales experience, preferably in CRM or HR Tech. In this role, you will be at the forefront of driving growth by identifying opportunities, building relationships with key decision-makers, and offering strategic solutions aligned with our vision of transforming the hiring process.Role and ResponsibilitiesDrive end-to-end B2B sales, from lead generation to deal closure.Develop and execute a strategic sales plan to achieve revenue targets.Build and maintain strong relationships with HR and talent acquisition leaders.Understand client hiring challenges and position FoxMatrix’s solution effectively.Conduct product demos and articulate value propositions clearly.Collaborate closely with marketing and product teams to align go-to-market strategies.Maintain accurate records of sales activities and pipeline in CRM tools.Stay updated on market trends, competition, and HR tech innovation.Requirements2.5 –4 years of proven experience in B2B sales, preferably in SaaS, CRM, HR Tech, or recruitment solutions.Strong understanding of the recruitment and assessment tools.Excellent communication, negotiation, and presentation skills.Ability to work in a fast-paced, startup environment with minimal supervision.Customer-first mindset with a knack for solution selling.Bachelor's degree in Business, Marketing, or a related field.Prior exposure to enterprise sales or consultative selling approaches.Network within HR or Talent Acquisition verticals.",
      "jobId": "4331155504",
      "jobUrl": "https://www.linkedin.com/jobs/view/4331155504"
    },
    {
      "location": "Gurugram",
      "scrapedAt": "2025-11-13T16:11:23.747Z",
      "title": "React Engineer",
      "company": "Codewinglet Private Limited",
      "description": "About the job\n            \n\n            \n                \n                  Job Title : React Engineer (1+ Years of Experience)Job Description:We are seeking a passionate and skilled React Engineer with over 1 year of experience to join our team. The ideal candidate will have hands-on experience building dynamic and responsive web applications using React.js. This role requires a strong understanding of front-end development principles and the ability to deliver high-quality, scalable solutions in a collaborative environment.Key Responsibilities      :Develop, maintain, and optimize web applications using React.js.Create reusable and modular components to ensure consistency and efficiency in development.Collaborate with designers and backend developers to implement user-friendly features.Debug and troubleshoot application issues to enhance performance and user experience.Integrate APIs and manage state effectively using tools like Redux, Context API, or React Query.Ensure responsive design and cross-browser compatibility for seamless user experiences.Write clean, well-documented, and maintainable code.Stay up-to-date with the latest React and front-end development trends\n.Core Proficienc      y:Strong understanding of JavaScript (ES6+).Proficiency in React.js and its core principles, including JSX, hooks, and lifecycle methods.Experience with state management libraries like Redux, Context API, or React Query.Proficiency in styling in the component.Familiarity with Tailwind CSS for efficient UI development and responsive design.Experience with CSS-in-JS libraries like Styled-Components or Emotion is a plus.Familiarity with Next.js for server-side rendering (SSR), static site generation (SSG), and routing capabilities.Hands-on experience integrating RESTful APIs or GraphQL into React applications.Proficient in Git for version control and collaborative development.Basic understanding of testing frameworks like Jest, React Testing Library, or Cypress.Understanding of code splitting, lazy loading, and performance optimization technique\ns.",
      "jobId": "4322205667",
      "jobUrl": "https://www.linkedin.com/jobs/view/4322205667"
    },
    {
      "location": "Ahmedabad",
      "scrapedAt": "2025-11-13T16:12:09.355Z",
      "title": "Software Engineer (Java, Python, Microservices, Agentic AI, AWS)",
      "company": "360tf",
      "description": "About the job\n            \n\n            \n                \n                  Job Description:We are seeking a motivated Software Engineer with 2–5 years of experience to join our dynamic development team. The ideal candidate will have strong expertise in Java, Microservices architecture, Spring Boot, and Python. Experience or knowledge of Agentic AI concepts and hands-on work with AWS services is highly desirable.Key Responsibilities:      Design, develop, and maintain scalable applications using Java, Spring Boot, and Microservices architecture.Write clean, maintainable, and efficient code in both Java and Python.Collaborate with cross-functional teams to deliver high-quality solutions.Develop and integrate Agentic AI components into applications.Deploy, monitor, and manage applications on AWS infrastructure.Troubleshoot and resolve software defects and issues.Contribute to code reviews, best practices, and continuous improvement.\nRequired Skills:      Strong hands-on experience with Java, Spring Boot, and Microservices design patterns.Good programming skills in Python.Understanding or experience with Agentic AI principles and frameworks.Solid experience working with AWS services (EC2, S3, Lambda, etc.).Familiarity with CI/CD pipelines and modern development tools.Good problem-solving skills and a collaborative mindset.\nPreferred Qualifications:      Bachelor’s degree in Computer Science, Engineering, or related field.Experience working in Agile environments.Knowledge of containerization (Docker, Kubernetes) is a plus.\nWhat We Offer:      Competitive salary and benefits.Opportunity to work with cutting-edge technologies.Collaborative and innovative work culture.Professional growth and learning opportunities.If you’re passionate about developing robust applications and working on emerging AI technologies, we’d love to hear from you!",
      "jobId": "4322108243",
      "jobUrl": "https://www.linkedin.com/jobs/view/4322108243"
    },
    {
      "location": "Ahmedabad",
      "scrapedAt": "2025-11-13T16:12:21.682Z",
      "title": "Software Engineer – Java, Python & Agentic AI",
      "company": "360tf",
      "description": "About the job\n            \n\n            \n                \n                  Job Description:We are seeking a motivated Software Engineer with 2–5 years of experience to join our dynamic development team. The ideal candidate will have strong expertise in Java, Microservices architecture, Spring Boot, and Python. Experience or knowledge of Agentic AI concepts and hands-on work with AWS services is highly desirable.Key Responsibilities:      Design, develop, and maintain scalable applications using Java, Spring Boot, and Microservices architecture.Write clean, maintainable, and efficient code in both Java and Python.Collaborate with cross-functional teams to deliver high-quality solutions.Develop and integrate Agentic AI components into applications.Deploy, monitor, and manage applications on AWS infrastructure.Troubleshoot and resolve software defects and issues.Contribute to code reviews, best practices, and continuous improvement.\nRequired Skills:      Strong hands-on experience with Java, Spring Boot, and Microservices design patterns.Good programming skills in Python.Understanding or experience with Agentic AI principles and frameworks.Solid experience working with AWS services (EC2, S3, Lambda, etc.).Familiarity with CI/CD pipelines and modern development tools.Good problem-solving skills and a collaborative mindset.\nPreferred Qualifications:      Bachelor’s degree in Computer Science, Engineering, or related field.Experience working in Agile environments.Knowledge of containerization (Docker, Kubernetes) is a plus.\nWhat We Offer:      Competitive salary and benefits.Opportunity to work with cutting-edge technologies.Collaborative and innovative work culture.Professional growth and learning opportunities.If you’re passionate about developing robust applications and working on emerging AI technologies, we’d love to hear from you!",
      "jobId": "4322068078",
      "jobUrl": "https://www.linkedin.com/jobs/view/4322068078"
    },
    {
      "location": "Ahmedabad",
      "scrapedAt": "2025-11-13T16:12:33.995Z",
      "title": "Software Engineer – .Net",
      "company": "GrowExx",
      "description": "About the job\n            \n\n            \n                \n                  Growexx is seeking a Software Engineer – .Net, who enjoys solving complex problems using clean, efficient, and performant methods and putting those solutions into action whilst working in a team.Key Responsibilities      Responsible for implementing assigned modules and ensuring timely, quality delivery. Work closely with L2/L3 engineers, PO, and ADMs to understand project requirements and deliver as per specifications. Participate in requirement discussions and clarify technical or functional doubts with the team. Contribute to UI development and assist in module integration as per the defined architecture. Implement front-end and back-end modules using .NET Core and Angular (or other assigned technologies). Perform unit testing, debugging, and ensure code quality through proper documentation and adherence to coding standards. Participate in code reviews and incorporate feedback from senior engineers. Analyze and understand user stories, technical requirements, and acceptance criteria before implementation. Identify and report any missing scenarios, blockers, or technical challenges to L2/L3 engineers for resolution. Create and maintain basic technical documentation and update tasks regularly in JIRA or other tools. Collaborate effectively with offshore/onshore teams through Slack, JIRA, or other communication channels. Continuously learn and upgrade technical skills as guided by mentors or team leads. Support team in testing, bug fixing, and deployment activities. Follow best practices for coding, version control, and documentation. \nKey Skills      2-4 years of experience with .NET technologies Experience with C#, .NET Core, and understanding of RESTful API development. Familiarity with Angular, JavaScript, HTML, CSS, and Ajax for front-end development. Understanding of OOPs concepts, basic Data Structures, and principles like Inheritance, Encapsulation, and Abstraction. Basic hands-on experience with MSSQL (writing queries, stored procedures, joins, etc.). Exposure to version control systems like Git and tools such as VS Code or Visual Studio. Willingness to work in Agile environments and learn Scrum or Kanban practices. Basic understanding of unit testing and clean coding practices. Awareness of information security and secure coding principles. \nEducation and Experience      B Tech or B. E. or MCA 2+years’ relevant experience in Software development \nAnalytical and Personal Skills      Must have good logical reasoning and analytical skills Must have good communication skills Is extrovert & Proactive not reactive Open to constructive debate and open to learning new concepts Able to receive constructive criticism, also team player with positive attitude Take own initiatives to achieve goals",
      "jobId": "4340241014",
      "jobUrl": "https://www.linkedin.com/jobs/view/4340241014"
    },
    {
      "location": "Ahmedabad",
      "scrapedAt": "2025-11-13T16:12:46.379Z",
      "title": "Development Specialist",
      "company": "Datacore Technologies",
      "description": "About the job\n            \n\n            \n                \n                  Total Yrs. of Experience: 5-8 YearsRelevant Yrs. of experience: 5 YearsDomain: FSMandatory skills:      PythonAWSPL/SQLBasic DevOpsRPA\nWork Location:      PuneHyderabadBangalore\nMode of Interview: VirtualMode of work: Hybrid",
      "jobId": "4320681345",
      "jobUrl": "https://www.linkedin.com/jobs/view/4320681345"
    },
    {
      "location": "Ahmedabad",
      "scrapedAt": "2025-11-13T16:12:52.593Z",
      "title": "JDE S&D Functional (WALKIN)",
      "company": "Tata Consultancy Services",
      "description": "About the job\n            \n\n            \n                \n                  Greetings from TCS Recruitment Team!For all those JDE S&D Functional we are coming bigger with the plan of Walk In Drive on 08-Nov-2025 (Saturday) in PUNE Locations.It is a Walk in Drive planned to attract great Talents in JDE S&D Functional. We believe that your skills and expertise are a better match for the skills we are looking for.Skill: JDE S&D Functional (WALKIN)Years of experience: 5 to 14 YearsWalk-In-Drive Location: PuneDate: 08-Nov-2025 (Walkin)Drive Time: 9AM to 1:00 PMWalk-in-Location Details: TCS Sahyadri Park is Sahyadri Park, Plot No. 2 & 3, Phase 3, Hinjewadi Rajiv Gandhi Infotech Park, Pune - 411057, MaharashtraJob Description:      JDE Implementation, Support and development experience on JD Edwards EnterpriseOne 9.2 version.JDE Modules: Experience in Sales Order Management, Advanced Pricing, Inventory Management, Procurement, Transportation, Warehouse Management.Analyze functional issues and provide resolution including workarounds.Emergency data fixes.Perform root cause analysis.Coordinate with business process owners/SMEs for support and development activities.Coordinate with technical team.Prioritize incidents.",
      "jobId": "4320363327",
      "jobUrl": "https://www.linkedin.com/jobs/view/4320363327"
    },
    {
      "location": "Ahmedabad",
      "scrapedAt": "2025-11-13T16:12:58.768Z",
      "title": "Software Engineer-Kinaxis Author Level",
      "company": "Tech Mahindra",
      "description": "About the job\n            \n\n            \n                \n                  Kinaxis Supply Author Level Consultant:5 years of experience in KinaxisMin two Project experience in KinaxisKinaxis Author level certificationExperience in Designing, Deploying and Support of Supply Planning Solution of Kinaxis Rapid Response.Should have good hands-on- Capacity, Safety stock and Inventory planning using RR.Expertise in Integrating Kinaxis with SAP ECC and Non- SAP applications.Expertise in configuring Work books , worksheets, scorecards , scenarios, scheduled tasks and AlertsExperience in SAP APO and SAP tables and data structures.Familiar with Post Go -Live support / Hypercare support of Kinaxis .Exposure to FMCG industry vertical is good to have.Kinaxis Demand Author Level Consultant:5 years of experience in KinaxisMin two Project experience in KinaxisKinaxis Author level certificationExperience in Designing, Deploying and Support of Demand Planning Solution of Kinaxis Rapid Response.Should have good hands-on- forecast modeling , Sales history Review, Demand planning cycles and S& OP processExpertise in Integrating Kinaxis with SAP ECC and Non- SAP applications.Expertise in configuring Work books , worksheets, scorecards , scenarios, scheduled tasks and AlertsExperience in SAP APO and SAP tables and data structures.Familiar with Post Go -Live support / Hypercare support of Kinaxis .Exposure to FMCG industry vertical is good to have.Location -Pan India",
      "jobId": "4285077045",
      "jobUrl": "https://www.linkedin.com/jobs/view/4285077045"
    },
    {
      "location": "Ahmedabad",
      "scrapedAt": "2025-11-13T16:13:04.937Z",
      "title": "Sales Consultant",
      "company": "InnovationM",
      "description": "About the job\n            \n\n            \n                \n                  We are seeking a dynamic and driven Senior Sales Consultant with 2.5 year to 4 years of B2B sales experience, preferably in CRM or HR Tech. In this role, you will be at the forefront of driving growth by identifying opportunities, building relationships with key decision-makers, and offering strategic solutions aligned with our vision of transforming the hiring process.Role and ResponsibilitiesDrive end-to-end B2B sales, from lead generation to deal closure.Develop and execute a strategic sales plan to achieve revenue targets.Build and maintain strong relationships with HR and talent acquisition leaders.Understand client hiring challenges and position FoxMatrix’s solution effectively.Conduct product demos and articulate value propositions clearly.Collaborate closely with marketing and product teams to align go-to-market strategies.Maintain accurate records of sales activities and pipeline in CRM tools.Stay updated on market trends, competition, and HR tech innovation.Requirements2.5 –4 years of proven experience in B2B sales, preferably in SaaS, CRM, HR Tech, or recruitment solutions.Strong understanding of the recruitment and assessment tools.Excellent communication, negotiation, and presentation skills.Ability to work in a fast-paced, startup environment with minimal supervision.Customer-first mindset with a knack for solution selling.Bachelor's degree in Business, Marketing, or a related field.Prior exposure to enterprise sales or consultative selling approaches.Network within HR or Talent Acquisition verticals.",
      "jobId": "4331155504",
      "jobUrl": "https://www.linkedin.com/jobs/view/4331155504"
    },
    {
      "location": "Ahmedabad",
      "scrapedAt": "2025-11-13T16:13:11.145Z",
      "title": "React Engineer",
      "company": "Codewinglet Private Limited",
      "description": "About the job\n            \n\n            \n                \n                  Job Title : React Engineer (1+ Years of Experience)Job Description:We are seeking a passionate and skilled React Engineer with over 1 year of experience to join our team. The ideal candidate will have hands-on experience building dynamic and responsive web applications using React.js. This role requires a strong understanding of front-end development principles and the ability to deliver high-quality, scalable solutions in a collaborative environment.Key Responsibilities      :Develop, maintain, and optimize web applications using React.js.Create reusable and modular components to ensure consistency and efficiency in development.Collaborate with designers and backend developers to implement user-friendly features.Debug and troubleshoot application issues to enhance performance and user experience.Integrate APIs and manage state effectively using tools like Redux, Context API, or React Query.Ensure responsive design and cross-browser compatibility for seamless user experiences.Write clean, well-documented, and maintainable code.Stay up-to-date with the latest React and front-end development trends\n.Core Proficienc      y:Strong understanding of JavaScript (ES6+).Proficiency in React.js and its core principles, including JSX, hooks, and lifecycle methods.Experience with state management libraries like Redux, Context API, or React Query.Proficiency in styling in the component.Familiarity with Tailwind CSS for efficient UI development and responsive design.Experience with CSS-in-JS libraries like Styled-Components or Emotion is a plus.Familiarity with Next.js for server-side rendering (SSR), static site generation (SSG), and routing capabilities.Hands-on experience integrating RESTful APIs or GraphQL into React applications.Proficient in Git for version control and collaborative development.Basic understanding of testing frameworks like Jest, React Testing Library, or Cypress.Understanding of code splitting, lazy loading, and performance optimization technique\ns.",
      "jobId": "4322205667",
      "jobUrl": "https://www.linkedin.com/jobs/view/4322205667"
    },
    {
      "location": "Ahmedabad",
      "scrapedAt": "2025-11-13T16:13:17.311Z",
      "title": "Digital Marketing Manager",
      "company": "Leemboodi",
      "description": "About the job\n            \n\n            \n                \n                  Salary Calibre: 35-45kResponsibilities:      Manage all digital marketing channels such as Facebook, Instagram and LinkedInStay up to date with the latest technology and best practicesMeasure ROI and KPIsOversee all the company's social media accountsManage and improve online content, considering presence with Google AnalyticsBuild an inbound marketing planForecast sales performance trendsMonitor competition and provide suggestions for improvement\nRequirements:      Good knowledge of all different digital marketing channelsGood knowledge and experience with online marketing tools and best practicesFamiliarity with web designSense of ownership and pride in your performance and its impact on a company’s successCritical thinker and problem-solving skillsTeam playerGood time-management skillsGreat interpersonal and communication skills",
      "jobId": "4334175730",
      "jobUrl": "https://www.linkedin.com/jobs/view/4334175730"
    }
  ]
}