{
  "totalNodeJobs": 10,
  "locations": [
    "Bangalore",
    "Pune",
    "Mumbai",
    "Gurugram",
    "Ahmedabad"
  ],
  "scrapedAt": "2025-11-13T16:13:34.514Z",
  "jobs": [
    {
      "location": "Bangalore",
      "scrapedAt": "2025-11-13T16:00:31.677Z",
      "title": "Senior Software Engineer - GoLang Developer",
      "company": "Sutherland",
      "description": "About the job\n            \n\n            \n                \n                  Company DescriptionAbout Sutherland: Artificial Intelligence. Automation. Cloud engineering. Advanced analytics. For business leaders, these are key factors of success. For us, they’re our core expertise.We work with iconic brands worldwide. We bring them a unique value proposition through market-leading technology and business process excellence.We’ve created over 200 unique inventions under several patents across AI and other critical technologies. Leveraging our advanced products and platforms, we drive digital transformation, optimize critical business operations, reinvent experiences, and pioneer new solutions, all provided through a seamless “as a service” model.For each company, we provide new keys for their businesses, the people they work with, and the customers they serve. We tailor proven and rapid formulas, to fit their unique DNA. We bring together human expertise and artificial intelligence to develop digital chemistry. This unlocks new possibilities, transformative outcomes and enduring relationships.SutherlandUnlocking digital performance. Delivering measurable resultsJob DescriptionIn the Role you get:       Hands on experience in GoLang, NodeJS 5 to 7 years of technical experience in full stack development Hands-on experience in Angular Hands-on experience with scripting languages in the back end (NodeJS, Python, Golang etc). Hands-on experience delivering microservices based architectures and design Hands-on experience working with Kubernetes based applications and container workloads Cloud Native (specifically good experience designing 12-factor apps). In depth understanding of Contract first/API first design and delivery experience. Strong experience in API design (OAS, middleware, external vs internal facing, etc.) Define Sutherland’s reputation: Oversee and manage performance and service quality to guarantee customer satisfaction; provide coaching and feedback. Work towards common goal of “One Sutherland Team playing to win”.\nQualificationsOur most successful candidates will have:       Academic: BE / BTECH (CSE, IT), B.Sc. (Computers), BCA / MCA Or Other Bachelor / Master’s Degree in Computing / IT preferred Functional Domain: Healthcare IT / IT Services Delivery domain. - Experience: Relevant years of experience in similar role. Communication skills: Have strong verbal and written communication skills, be able to communicate in a clear, constructive, and professional manner. Personality: Good time-management skills. Team player: Be pro-active in developing trust and professional rapport with employees and team members; work as a team-player Ability to handle multiple tasks simultaneously. Ability to work in a fast-paced environment with minimal supervision. Sense of ownership and pride in your performance and its impact on the company’s success. Critical thinker and problem-solving skills. Be strategic in developing solutions and process improveme",
      "jobId": "4335743534",
      "jobUrl": "https://www.linkedin.com/jobs/view/4335743534"
    },
    {
      "location": "Bangalore",
      "scrapedAt": "2025-11-13T16:01:45.977Z",
      "title": "Full Stack Developer (Mid-Level)",
      "company": "4baseCare",
      "description": "About the job\n            \n\n            \n                \n                  We’re Hiring: Full Stack Developer (Mid-Level)Are you a passionate developer who loves building scalable, high-impact web applications?Join 4baseCare Precision Health Pvt. Ltd., where innovation meets purpose! 🚀💼 Position: Full Stack Developer (Java, Node.js, React, MySQL, Angular)📍 Location: Bangalore🕓 Experience: 2+ years🔧 What You’ll Do      Design, develop, and implement robust and scalable web applications using Java, Node.js, and React.js.\n      Develop and integrate RESTful APIs for seamless front-end and back-end communication.\n      Manage and optimize MySQL databases — schema design, query performance, and scalability.\n      Collaborate with UX/UI designers, product managers, and developers to deliver world-class features.\n      Write clean, maintainable, and testable code following best practices.\n      Participate in code reviews and mentor junior developers.\n      Troubleshoot, debug, and enhance production systems.\n      Implement secure authentication and authorization (JWT, OAuth).\n      Work with Microservices architecture and stay updated with the latest tech trends.\n🎯 What We’re Looking For      Bachelor’s degree in Computer Science, Engineering, or related field.\n      2+ years of experience in Full Stack Development (Java, Node.js, React).\n      Strong hands-on with MySQL, HTML, CSS, JavaScript, TypeScript.\n      Familiar with Git/GitHub, Agile methodologies, and unit testing (Jest, Chai, Mocha).\n      Excellent problem-solving skills, teamwork, and communication.\n🌈 Bonus Points For      Experience with AWS / GCP.\n      Exposure to Docker / Kubernetes.\n      Familiarity with CI/CD tools like Jenkins, GitLab CI, or BitBucket Pipelines.\n      Knowledge of Angular.js or Python.\n✨ If you’re ready to code, collaborate, and create impact — we’d love to hear from you!📩 Apply Now: careers@4basecare.com",
      "jobId": "4322116481",
      "jobUrl": "https://www.linkedin.com/jobs/view/4322116481"
    },
    {
      "location": "Bangalore",
      "scrapedAt": "2025-11-13T16:01:58.333Z",
      "title": "Software Engineer 2",
      "company": "Archer Integrated Risk Management",
      "description": "About the job\n            \n\n            \n                \n                  Job DetailsDescriptionGENERAL SUMMARY: Archer is the industry-leading enterprise software for Integrated Risk Management and recognized as leaders in the Gartner quadrant for several years now. Archer helps organizations manage risk in the digital era—uniting stakeholders, integrating technologies, and transforming risk into reward. Over a thousand customers worldwide harness the ArcherIRM platform and its comprehensive suite of solutions to automate the compliance process, meet their risk objectives, and optimize business.This position is for a modern and brand new SaaS product “Archer Engage” having 120+ customers worldwide. Archer Engage suite of products delivers a modern, consumer app-like user experience to the infrequent users and stake holders to ensure active engagement in helping the enterprise manage risk and third-party risk management. Engage is based on serverless architecture and built on cutting edge technology stack comprising of AWS Cloud Native Services, ReactJS,.NETCore, NodeJS, Kubernetes and Gitlab CI/CD. For more information, visit https://www.archerirm.com/We are seeking a passionate, self-motivated Software Quality Engineer with proven hands-on experience in Manual and Automated testing. You will be joining a top notch and highly motivated team of DevOps engineers who thrive on end-to-end ownership of entire product life cycle starting from design to deployment to operations.Principal Duties And Responsibilities      Authors and executes test cases and testing methodology for manual and/or automated tests.Understands and adheres to delivery/quality targets established during regression and testing phase.Contribute to test automation activities through knowledge of coding/programming in current languages.Develops new test methodologies or processes, re-evaluates existing processes. Contributes to the development and achievement of organizational goals and objectives.General understanding of business environment. Fosters teamwork and collaboration within and across work groups.Responsible for providing requirements and specifications for the test cases.Accountable for delivery of subsystem, anticipate issues and addresses proactively.Fully competent in the design, implementation, and maintenance of a test environment, including necessary equipment, configuration, and software.Demonstrated skill with developing appropriate test methodologies. Fully competent in the use of necessary tools and applications.\nRequired Skills      Good knowledge in SDLCExperience in Software Test Life Cycle (Test Estimation, Test Strategy, Test Plan, Testing, Defect Mgmt, etc) General knowledge of .NET, MS SQL, JavaScript.Experience in UI & API Test Automation Framework (Preferably Playwright)Experience in Test automation scripting (Say, Typescript)Experience in Agile.Working knowledge in Enterprise SaaS productEducation: BE/BTech/MCA or equivalent Computer Science qualif",
      "jobId": "4340533723",
      "jobUrl": "https://www.linkedin.com/jobs/view/4340533723"
    },
    {
      "location": "Bangalore",
      "scrapedAt": "2025-11-13T16:03:24.830Z",
      "title": "Java Full stack Developer",
      "company": "Qualitest",
      "description": "About the job\n            \n\n            \n                \n                  Job Description Technical Skills      Programming Languages: Proficient in Java (8+), JavaScript, HTML, CSS, and PL/SQL. Frameworks & Libraries: Hands-on experience with Spring Boot, React.js, and Node.js. Web Services: Strong knowledge of REST and SOAP API development and integration. Version Control: Experience with Git and collaborative development using GitHub. Backend & Databases: Expertise in Oracle and PostgreSQL (preferred: Postgres shining stars ). CI/CD Tools: Working knowledge of Jenkins, GitHub Actions, and applying TDD/BDD practices. Testing Tools: Experience with ReadyAPI, Postman, Jest, and JUnit for automated and integration testing. Cloud Technologies: Exposure to OCI (Oracle Cloud Infrastructure), Azure, AWS, or equivalent cloud environments. AI Tools: Familiar with GitHub Copilot for enhanced development productivity. Containerization & Microservices: Practical experience with Docker, Kubernetes (K8s), Microservices, and Micro Frontends. \nNice to Have      Test Automation Frameworks: Experience with Selenium, Cucumber (Java), and Kafka integration. \n4 must havesJava: 4/5React JS, Springboot: 4/5Database (Oracle): 3/5CI/CD and Version: 4/5",
      "jobId": "4339902767",
      "jobUrl": "https://www.linkedin.com/jobs/view/4339902767"
    },
    {
      "location": "Pune",
      "scrapedAt": "2025-11-13T16:06:03.630Z",
      "title": "Full Stack Engineer",
      "company": "Terra Technology Circle Consulting Private Limited",
      "description": "About the job\n            \n\n            \n                \n                  Job Title: MERN Stack DeveloperExperience: 2–3 yearsLocation: Pune, Bangalore and NoidaEmployment Type: PermanentAbout the RoleWe are looking for a talented MERN Stack Developer to join our development team. The ideal candidate will have hands-on experience building scalable web applications using MongoDB, Express.js, React.js, and Node.js, and a passion for writing clean, efficient code.Key Responsibilities      Develop, test, and maintain full-stack web applications using the MERN stack.Design and implement RESTful APIs and integrate with front-end components.Collaborate with UI/UX designers and backend teams to deliver seamless user experiences.Optimize applications for speed, scalability, and performance.Participate in code reviews, debugging, and deployment activities.Stay updated with emerging technologies and best practices in web development.\nRequired Skills & Qualifications      2–3 years of experience in full-stack development using MERN (MongoDB, Express.js, React.js, Node.js).Strong proficiency in JavaScript (ES6+), HTML, CSS, and related front-end technologies.Experience with version control systems (Git) and RESTful API design.Familiarity with cloud deployment (AWS, Azure, or similar) and CI/CD pipelines is a plus.Good problem-solving skills and ability to work collaboratively in an agile environment.\nWhat We Offer      Competitive salary and benefits package.Opportunity to work on innovative projects with modern technologies.Supportive and collaborative team culture.",
      "jobId": "4340412958",
      "jobUrl": "https://www.linkedin.com/jobs/view/4340412958"
    },
    {
      "location": "Pune",
      "scrapedAt": "2025-11-13T16:06:16.056Z",
      "title": "Node.JS Engineer",
      "company": "Workassist",
      "description": "About the job\n            \n\n            \n                \n                  Work Level: IndividualCore: Result Driven, Adaptable, OrganizedLeadership: Decisive, ResponsiveIndustry Type: Software ProductFunction: Full Stack DeveloperKey Skills: Node JS,Javascript,Fullstack Developer,Spring MVC,Restful Web Services,CI/CD,DockerEducation: GraduateNote: This is a requirement for one of the Workassist Hiring Partner.Key Requirements      At least 8+ years of technology and banking domain experience with significant exposure to digital and mobility platformsAt least 6 years’ and hands on in designing and developing NodeJS microservices in mobility applicationsStrong knowledge and experience of the following technologies:Frontend Native – iOS & AndroidBackend Languages – NodeJS, Java Script, Express NodeJS, Full StackDatabase – Oracle, PostgreSQL,DymanoDBDevelopment Framework – MVC, TDD, ReST APIsTesting Framework – Mocha ChaiCode Review Framework – PrismaExperience with CI/CD pipeline, and automation (Gitlab, Nexus etc.)AWS experience including EC2, EKS, Docker, SQS, SNS, Lambda, Kong API Gateway is a plusExperiences of engineering practices such as code refactoring, design patterns, design-driven development, continuous integration, Dev-Ops, building highly scalable applications, application security.Ability to work effectively with people at all levels in an organizationBeing a participant in technical communities such as external/internal meetups e.g., speak at conferences, author books and blog posts is an advantage\nKey Responsibilities      Responsible for developing and managing mobility backend platforms, QA and Integration services within Fab / Third-party systems,Provide production support for application issues and bug fixesResponsible to ensure development meets business requirements with high qualityWork closely with Service Delivery Manager, Scrum team and Solution Architect to plan and deliver backend application servicesOwnership and accountability of the overall development, preparation of LLD, Release notes and deployment documentsIntroduce and maintain best practices, technologies to ensure product stays on the leading edge of technology.Utilize a mix of open Source and commercial technologies to create the foundation for rapid and cost-effective implementation of systems that maximize value from day one in alignment with the bank’s policies and procedures and in alignment with different teams within the bank.Collaborate and facilitate integration with other teams and products within the bank including risk, security and compliance.\nCompany DescriptionWorkassist is an online recruitment and employment solution platform based in Lucknow, India. We provide relevant profiles to employers and connect job seekers with the best opportunities across various industries. With a network of over 10,000+ recruiters, we help employers recruit talented individuals from sectors such as Banking & Finance, Consulting, Sales & Marketing, HR, IT, Operat",
      "jobId": "4335649509",
      "jobUrl": "https://www.linkedin.com/jobs/view/4335649509"
    },
    {
      "location": "Pune",
      "scrapedAt": "2025-11-13T16:06:28.471Z",
      "title": "Software Engineer",
      "company": "MPencil",
      "description": "About the job\n            \n\n            \n                \n                  Hiring: Freelance Software Developer (Part-Time / Remote)Tech Stack Required: Next.js, React.js, MongoDBExperience: 1 to 3 yearsCompensation: ₹5,000/month (Part-time Freelance)We are looking for a dedicated Freelance Software Developer who is comfortable working on web development tasks and supporting ongoing product development. Ideal for someone who wants consistent monthly freelance work with flexibility.Responsibilities      Frontend development using Next.js / React.jsBackend work with Node.js & MongoDBBug fixing, small feature improvements, UI changesCollaborating with our tech team as neededMust be available for weekly syncs & updates\nRequirements      1–3 years of experience in web developmentStrong hands-on with Next.js and React.jsExperience with REST APIs, Node.js & MongoDBAbility to work independently & deliver on time\nNice to Have      Experience with GitBasic UI/UX understandingFamiliarity with deployment (Vercel / Render / AWS)\nWork Mode      RemoteFlexible hoursLong-term freelance opportunity for the right candidate\n📩 How to Apply:Send your resume to info@mpencil.in",
      "jobId": "4322082753",
      "jobUrl": "https://www.linkedin.com/jobs/view/4322082753"
    },
    {
      "location": "Gurugram",
      "scrapedAt": "2025-11-13T16:09:07.670Z",
      "title": "Full Stack Engineer",
      "company": "Paisabazaar",
      "description": "About the job\n            \n\n            \n                \n                  Job Description – MERN Stack DeveloperWe are looking for a skilled MERN Stack Developer to join our dynamic team. The ideal candidate should have hands-on experience in MongoDB, Express.js, React.js, and Node.js, with strong problem-solving skills and a passion for building scalable web applications.Key Responsibilities      Develop, test, and deploy full-stack web applications using the MERN stackCollaborate with cross-functional teams to define and deliver new featuresOptimize application performance and ensure responsivenessMaintain code quality, organization, and automation\nRequirements      Strong proficiency in JavaScript (ES6+), React.js, Node.js, and Mongo DB.Experience with RESTful APIs and version control (Git).Good understanding of front-end and back-end architecture.",
      "jobId": "4340455030",
      "jobUrl": "https://www.linkedin.com/jobs/view/4340455030"
    },
    {
      "location": "Gurugram",
      "scrapedAt": "2025-11-13T16:09:32.346Z",
      "title": "Technical Architect",
      "company": "Synaxis Informatic Tech Solutions",
      "description": "About the job\n            \n\n            \n                \n                  We are seeking a seasoned Technical Architect with 12+ years of hands-on experience to lead the design and development of scalable enterprise solutions. This is a critical role for candidates with deep technical expertise in backend development, cutting-edge cloud and microservices architectures, SaaS/B2B platforms, and modern DevOps and AI/ML practices. Required Skills & Qualifications*12–18 years of experience as a solution or technical architect in high-growth product or platform environments*Advanced expertise in backend architecture (Node.js, Python), microservices, APIs, and cloud infrastructure*Hands-on experience with Docker, container orchestration, and CI/CD automation (Jenkins, GitLab CI, etc.)*Experience integrating and optimizing AI/ML solutions in enterprise products*B2B/SaaS platform architecture and scaling knowledge*Strong understanding of DevOps, infrastructure as code (Terraform, Ansible), and security best practices*Excellent analytical, communication, and leadership skills*Bachelor’s/Master’s in Computer Science, Engineering, or related field\n                \n                \n                Desired Skills and Experience\n                \n                  backend development , microservices , Docker , Node.js , Python , AI/ML , cloud , APIs , DevOps , SaaS/B2B platforms , analytical skills , communication skills , leadership skills",
      "jobId": "4336042055",
      "jobUrl": "https://www.linkedin.com/jobs/view/4336042055"
    },
    {
      "location": "Gurugram",
      "scrapedAt": "2025-11-13T16:10:21.848Z",
      "title": "Full Stack Developer",
      "company": "CirclePe",
      "description": "About the job\n            \n\n            \n                \n                  Company Description:CirclePe is transforming India’s rental landscape by removing the burden of security deposits. As an exclusive club for trustworthy tenants, CirclePe enables members to move into their dream homes with zero-security deposits.Backed by OTP Ventures, IIT Delhi, and the founders of BharatPe and Paytm, CirclePe is building a trusted, transparent, and accessible renting ecosystem.Headquartered in Gurugram, we’re a team driven by innovation, trust, and impact.Role: Full Stack DeveloperLocation: On-site, GurugramType: Full-timeCompensation: ₹5.5 – ₹9 LPAQualifications:- Proficiency in Full-Stack Development front-end and back-end.- Strong understanding of core web technologies.-Experience with modern front-end frameworks (React, Next.js, or similar).- Experience with Node.js, NestJS, or Express.js for backend development.- Familiarity with databases like MongoDB, PostgreSQL, or MySQL.- Familiarity with cloud services(AWS, GCP).- Strong problem-solving and debugging skills.- Ability to work collaboratively in an agile team environment.- Prior experience in fintech is a plus.got any queries?drop here at akash@circlepe.com",
      "jobId": "4322165879",
      "jobUrl": "https://www.linkedin.com/jobs/view/4322165879"
    }
  ]
}